<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Yoffe</title>
        
    <link rel="stylesheet" type="text/css" href="static/css/main.css">
</head>
<body>
<div class="navbar ">
    <div class="container">
        <div class="logo">
            
                Yoffe
            
        </div>
        <input type="checkbox" id="idoc_nav" />
        <div class="menu_tree">
        <ul><li class="active"><a href="index.html">首页</a></li></ul>    
        </div>
        
        
        <div class="forkgithub"><a target="_blank" href="https://github.com/GuoYongfeng">fork on github</a></div>
        

        <section class="idoc_nav_btn">
            <label for="idoc_nav"><span></span></label>
        </section>
    </div>
    
</div>



<div class="bs-docs-header">
    <div class="container">
        <h1>Yoffe</h1>
        <p>Welcome To GuoYongfeng&#39;s Blog</p>
    </div>
</div>


<div class="container">

    <div class="page-toc">
        <ul><li><a href="#t0逝去的 2016">逝去的 2016</a></li><li><a href="#t1你好，2017">你好，2017</a><ul><li><a href="#t2改变现有的yoffe个人博客">改变现有的yoffe个人博客</a></li><li><a href="#t3打造完整全面的在线前端技术视频">打造完整全面的在线前端技术视频</a></li><li><a href="#t4团队博客和知乎专栏">团队博客和知乎专栏</a></li><li><a href="#t5合作和建议">合作和建议</a></li></ul></li></ul>
    </div>
    
    <div class="content markdown-body">
        <blockquote>
<p><strong>&#x91CD;&#x8981;&#x63D0;&#x793A;&#xFF1A;&#x539F;&#x6587;&#x6863;&#x5185;&#x5BB9;&#x8BF7;<a href="https://github.com/GuoYongfeng/idoc/tree/2016_bak/md">&#x524D;&#x5F80;&#x8FD9;&#x91CC;&#x67E5;&#x770B;</a></strong></p>
</blockquote>
<p>&#x4EB2;&#x7231;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#xFF0C;&#x611F;&#x8C22;&#x4F60;&#x4E00;&#x8DEF;&#x65E2;&#x5F80;&#x5BF9;&#x6211;&#x7684;&#x652F;&#x6301;&#xFF0C;2017&#x5DF2;&#x6765;&#xFF0C;&#x6280;&#x672F;&#x8FD8;&#x5728;&#x8FED;&#x4EE3;&#x66F4;&#x65B0;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5B66;&#x4E60;&#x70ED;&#x60C5;&#x4E5F;&#x4E0D;&#x9000;&#x51CF;&#xFF0C;&#x4FDD;&#x6301;&#x9AD8;&#x6602;&#x7684;&#x5B66;&#x4E60;&#x59FF;&#x6001;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x90FD;&#x84B8;&#x84B8;&#x65E5;&#x4E0A;&#x7684;&#x4E0D;&#x7AED;&#x52A8;&#x529B;&#x3002;</p>
<h1 id="t0&#x901D;&#x53BB;&#x7684; 2016">&#x901D;&#x53BB;&#x7684; 2016 <a href="#t0&#x901D;&#x53BB;&#x7684; 2016"> # </a></h1>
<p>&#x5728;2016&#x5E74;&#x521D;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x4F7F;&#x7528;markdown&#x6587;&#x6863;&#x6765;&#x6574;&#x7406;&#x4E00;&#x4E9B;&#x5BF9;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x901A;&#x8FC7;idoc&#x8FD9;&#x4E00;&#x7B80;&#x5355;&#x65B9;&#x4FBF;&#x7684;&#x5DE5;&#x5177;&#x5C06;&#x6587;&#x6863;&#x751F;&#x6210;html&#x6587;&#x4EF6;&#x4F9B;&#x5927;&#x5BB6;&#x9884;&#x89C8;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x5C06;&#x751F;&#x6210;&#x7684;&#x6574;&#x7AD9;&#x8D44;&#x6E90;&#x901A;&#x8FC7;github pages&#x53D1;&#x5E03;&#x8BA9;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x9884;&#x89C8;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x670B;&#x53CB;&#x90FD;&#x4F1A;&#x627E;&#x6211;&#x54A8;&#x8BE2;&#x524D;&#x7AEF;&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5305;&#x62EC;&#x79FB;&#x52A8;&#x7AEF;&#x3001;react&#x3001;node&#x3001;&#x524D;&#x7AEF;&#x67B6;&#x6784;&#x7B49;&#x7B49;&#xFF0C;&#x975E;&#x5E38;&#x8363;&#x5E78;&#x6211;&#x7684;&#x4E00;&#x4E9B;&#x6587;&#x5B57;&#x80FD;&#x591F;&#x8BA9;&#x5927;&#x5BB6;&#x5728;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x8DEF;&#x4E0A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4E00;&#x76F4;&#x575A;&#x6301;&#x5F00;&#x653E;&#x514D;&#x8D39;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5E2E;&#x52A9;&#x5927;&#x5BB6;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x8BA9;&#x6211;&#x81EA;&#x5DF1;&#x6709;&#x4E86;&#x5C0F;&#x5C0F;&#x7684;&#x6210;&#x5C31;&#x611F;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5927;&#x5BB6;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x666E;&#x904D;&#x5BF9;&#x6587;&#x7AE0;&#x5185;&#x5BB9;&#x4E2D;&#x8BE6;&#x7EC6;&#x7684;&#x5B9E;&#x8DF5;&#x64CD;&#x4F5C;&#x6BD4;&#x8F83;&#x8BA4;&#x53EF;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x51FA;&#x73B0;&#x6216;&#x662F;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x67D0;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#xFF0C;&#x603B;&#x662F;&#x788D;&#x4E8E;&#x5176;&#x4ED6;&#x6E20;&#x9053;&#x4E00;&#x4E9B;&#x5197;&#x957F;&#x7684;&#x535A;&#x6587;&#x6216;&#x662F;&#x6BD4;&#x8F83;&#x865A;&#x5316;&#x7684;&#x6982;&#x5FF5;&#x800C;&#x8FDF;&#x8FDF;&#x65E0;&#x6CD5;&#x5B66;&#x4E60;&#x4E0A;&#x624B;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x4E5F;&#x6709;&#x90E8;&#x5206;&#x540C;&#x5B66;&#x4E0D;&#x592A;&#x4E60;&#x60EF;&#x82F1;&#x6587;&#x6587;&#x6863;&#x7684;&#x67E5;&#x770B;&#xFF0C;&#x8FD9;&#x4E5F;&#x6B63;&#x662F;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x8003;&#x8651;&#x6211;&#x624D;&#x6709;&#x4E86;&#x5207;&#x5165;&#x70B9;&#x53BB;&#x6301;&#x7EED;&#x7684;&#x5199;&#x4F5C;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x6280;&#x672F;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#x70B9;&#x5C31;&#x662F;&#x6210;&#x4F53;&#x7CFB;&#xFF0C;&#x6BD4;&#x5982;react&#xFF0C;&#x603B;&#x662F;&#x53EA;&#x8A00;&#x7247;&#x8BED;&#x6216;&#x662F;&#x8FB9;&#x8FB9;&#x89D2;&#x89D2;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x65E0;&#x6CD5;&#x6709;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x70B9;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x4FC3;&#x6210;&#x4E86;&#x65E9;&#x671F;&#x7684;yoffe&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x5F62;&#x6001;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x8981;&#x5BF9;&#x5E7F;&#x5927;&#x7684;&#x8BFB;&#x8005;&#x670B;&#x53CB;&#x4EEC;&#x9053;&#x6B49;&#xFF0C;&#x56E0;&#x4E3A;&#x4E2A;&#x4EBA;&#x7684;&#x61D2;&#x60F0;&#xFF0C;&#x5728;&#x540E;&#x671F;&#x4FBF;&#x6CA1;&#x6709;&#x5BF9;&#x535A;&#x5BA2;&#x7684;&#x5185;&#x5BB9;&#x6301;&#x7EED;&#x66F4;&#x65B0;&#x4E86;&#x3002;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x8FD8;&#x662F;&#x5728;&#x6301;&#x7EED;&#x4EA7;&#x51FA;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5C55;&#x793A;&#x7684;&#x6E20;&#x9053;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x4E86;&#x3002;&#x4E3B;&#x8981;&#x5728;&#x4EE5;&#x4E0B;&#x5730;&#x65B9;&#xFF1A;</p>
<ul>
<li><a href="https://github.com/iuap-design/blog/issues">&#x7528;&#x53CB;&#x7F51;&#x7EDC;FED&#x56E2;&#x961F;&#x535A;&#x5BA2;</a></li>
<li><a href="https://guoyongfeng.github.io/book/">&#x300A;&#x73B0;&#x4EE3;&#x5316;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x6743;&#x5A01;&#x6307;&#x5357;&#x300B;</a></li>
<li><a href="http://www.zhufengpeixun.cn/react/index.html">&#x73E0;&#x5CF0;&#x524D;&#x7AEF;&#x67B6;&#x6784;&#x5E08;&#x4E4B;&#x8DEF;&#x4E4B;React&#x8BFE;&#x7A0B;</a></li>
</ul>
<h1 id="t1&#x4F60;&#x597D;&#xFF0C;2017">&#x4F60;&#x597D;&#xFF0C;2017 <a href="#t1&#x4F60;&#x597D;&#xFF0C;2017"> # </a></h1>
<p>&#x5F00;&#x59CB;&#x5168;&#x65B0;&#x7684;2017&#xFF0C;&#x4F60;&#x6211;&#x7684;&#x6280;&#x672F;&#x4E4B;&#x8DEF;&#x4E5F;&#x5728;&#x8FC7;&#x53BB;&#x4E00;&#x5E74;&#x7684;&#x79EF;&#x7D2F;&#x4E0A;&#x542F;&#x7A0B;&#x51FA;&#x53D1;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#xFF0C;&#x6211;&#x4E5F;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x5347;&#x7EA7;&#x548C;&#x6539;&#x53D8;&#x3002;</p>
<h2 id="t2&#x6539;&#x53D8;&#x73B0;&#x6709;&#x7684;yoffe&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;">&#x6539;&#x53D8;&#x73B0;&#x6709;&#x7684;yoffe&#x4E2A;&#x4EBA;&#x535A;&#x5BA2; <a href="#t2&#x6539;&#x53D8;&#x73B0;&#x6709;&#x7684;yoffe&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;"> # </a></h2>
<p>&#x76EE;&#x524D;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x7684;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x5C06;&#x4F1A;&#x68B3;&#x7406;&#x540E;&#x8F6C;&#x79FB;&#x5230;<strong>&#x300A;&#x73B0;&#x4EE3;&#x5316;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x6743;&#x5A01;&#x6307;&#x5357;&#x300B;</strong>&#x4E0A;&#xFF0C;&#x800C;yoffe&#x5C06;&#x4F1A;&#x6210;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x4E2A;&#x4EBA;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x7F51;&#x7AD9;&#xFF0C;&#x540C;&#x65F6;&#x4F1A;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x5F00;&#x542F;&#x4E2A;&#x4EBA;&#x4E13;&#x680F;&#x548C;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x7684;&#x4E13;&#x680F;&#x3002;</p>
<p>&#x8981;&#x91CD;&#x70B9;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x76EE;&#x524D;&#x535A;&#x5BA2;&#x4E0A;&#x7684;&#x5185;&#x5BB9;&#x5C06;&#x4F1A;&#x5907;&#x4EFD;&#x5728;&#xFF1A;2016_dev&#x5206;&#x652F;&#x3002;master&#x5206;&#x652F;&#x4EE5;&#x53CA;&#x8BBF;&#x95EE;&#xFF1A;<a href="http://guoyongfeng.github.io/idoc/index.html&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x5C06;&#x4F1A;&#x5B8C;&#x5168;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x91CC;&#x63D0;&#x524D;&#x548C;&#x5927;&#x5BB6;&#x8BF4;&#x660E;&#x3002;">http://guoyongfeng.github.io/idoc/index.html&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x5C06;&#x4F1A;&#x5B8C;&#x5168;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x91CC;&#x63D0;&#x524D;&#x548C;&#x5927;&#x5BB6;&#x8BF4;&#x660E;&#x3002;</a></p>
<p>&#x5728;&#x8FC7;&#x53BB;&#x4E00;&#x5E74;&#x5728;&#x77E5;&#x8BC6;&#x4F20;&#x64AD;&#x4E0A;&#x505A;&#x7684;&#x592A;&#x5C11;&#x4E86;&#xFF0C;&#x4ECA;&#x5E74;&#x4F1A;&#x4EA7;&#x51FA;&#x66F4;&#x591A;&#x4F18;&#x8D28;&#x5185;&#x5BB9;&#xFF0C;&#x6301;&#x7EED;&#x548C;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4E5F;&#x8BF7;&#x5927;&#x5BB6;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#x7684;&#x56E2;&#x961F;&#x6280;&#x672F;&#x535A;&#x5BA2;&#xFF1A;<a href="https://github.com/iuap-design/blog/issues&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x505A;&#x7684;&#x7CFB;&#x5217;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#xFF1A;https://github.com/iuap-design">https://github.com/iuap-design/blog/issues&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x505A;&#x7684;&#x7CFB;&#x5217;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#xFF1A;https://github.com/iuap-design</a></p>
<h2 id="t3&#x6253;&#x9020;&#x5B8C;&#x6574;&#x5168;&#x9762;&#x7684;&#x5728;&#x7EBF;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x89C6;&#x9891;">&#x6253;&#x9020;&#x5B8C;&#x6574;&#x5168;&#x9762;&#x7684;&#x5728;&#x7EBF;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x89C6;&#x9891; <a href="#t3&#x6253;&#x9020;&#x5B8C;&#x6574;&#x5168;&#x9762;&#x7684;&#x5728;&#x7EBF;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x89C6;&#x9891;"> # </a></h2>
<p>&#x662F;&#x7684;&#xFF0C;&#x5728;&#x53BB;&#x5E74;&#x4E2D;&#x4E0B;&#x65EC;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x5C1D;&#x8BD5;&#x5F55;&#x5236;&#x5728;&#x7EBF;&#x7684;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x3002;&#x5185;&#x5BB9;&#x7684;&#x5F62;&#x5F0F;&#x6BD4;&#x8F83;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x5C06;&#x5927;&#x7684;&#x5B66;&#x4E60;&#x4F53;&#x7CFB;&#x7EFC;&#x5408;&#x5E76;&#x4E14;&#x62C6;&#x89E3;&#xFF0C;&#x5355;&#x72EC;&#x7684;&#x6280;&#x672F;&#x70B9;&#x548C;&#x5B9E;&#x6218;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x6280;&#x672F;&#x70B9;&#x7684;&#x8BB2;&#x89E3;&#x90FD;&#x901A;&#x8FC7;5-20&#x5206;&#x949F;&#x7684;&#x5C0F;&#x89C6;&#x9891;&#x8FDB;&#x884C;&#x5448;&#x73B0;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x914D;&#x5957;&#x4E86;&#x4EE3;&#x7801;&#x548C;&#x8BB2;&#x89E3;&#x6587;&#x6863;&#x3002;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x6709;&#x8D85;&#x8FC7;1000&#x540D;&#x540C;&#x5B66;&#x89C2;&#x770B;&#x5B66;&#x4E60;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E5F;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x8BF7;&#x524D;&#x5F80;&#xFF1A;<a href="http://www.zhufengpeixun.cn/react/index.html&#x3002;">http://www.zhufengpeixun.cn/react/index.html&#x3002;</a></p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x4ED8;&#x8D39;&#x8BFE;&#x7A0B;&#xFF0C;&#x4ED8;&#x8D39;&#x540E;&#x6709;&#x5168;&#x7A0B;&#x7684;&#x5B66;&#x4E60;&#x5C0F;&#x7EC4;&#x548C;&#x73ED;&#x4E3B;&#x4EFB;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x5B66;&#x4E60;&#x6548;&#x7387;&#x5F88;&#x9AD8;&#x3002;</p>
<h2 id="t4&#x56E2;&#x961F;&#x535A;&#x5BA2;&#x548C;&#x77E5;&#x4E4E;&#x4E13;&#x680F;">&#x56E2;&#x961F;&#x535A;&#x5BA2;&#x548C;&#x77E5;&#x4E4E;&#x4E13;&#x680F; <a href="#t4&#x56E2;&#x961F;&#x535A;&#x5BA2;&#x548C;&#x77E5;&#x4E4E;&#x4E13;&#x680F;"> # </a></h2>
<p>&#x4ECA;&#x5E74;&#xFF0C;&#x6211;&#x4F1A;&#x52A0;&#x5F3A;&#x6280;&#x672F;&#x7684;&#x4F20;&#x64AD;&#x548C;&#x63A8;&#x5E7F;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x9AD8;&#x5185;&#x5BB9;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x8F7B;&#x677E;&#x6109;&#x5FEB;&#x7684;&#x83B7;&#x53D6;&#x6700;&#x65B0;&#x7684;&#x6280;&#x672F;&#x5E76;&#x8FD0;&#x7528;&#x3002;&#x8BF7;&#x6301;&#x7EED;&#x5173;&#x6CE8;~</p>
<h2 id="t5&#x5408;&#x4F5C;&#x548C;&#x5EFA;&#x8BAE;">&#x5408;&#x4F5C;&#x548C;&#x5EFA;&#x8BAE; <a href="#t5&#x5408;&#x4F5C;&#x548C;&#x5EFA;&#x8BAE;"> # </a></h2>
<ul>
<li>&#x5982;&#x679C;&#x4F60;&#x76EE;&#x524D;&#x5C31;&#x5728;&#x9605;&#x8BFB;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x4E00;&#x4E9B;&#x6539;&#x8FDB;&#x7684;&#x5EFA;&#x8BAE;&#x548C;&#x60F3;&#x6CD5;&#xFF0C;&#x8BF7;&#x76F4;&#x63A5;email&#x7ED9;&#x6211;&#xFF1A;296512521@qq.com&#x3002;</li>
<li>&#x5408;&#x4F5C;<ul>
<li>&#x4E66;&#x7C4D;&#x7F16;&#x5199;&#x5408;&#x4F5C;&#xFF1A;&#x4E00;&#x4E2A;&#x4EBA;&#x5199;&#x5185;&#x5BB9;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#xFF0C;&#x671F;&#x5F85;&#x4F60;&#x548C;&#x6211;&#x4E00;&#x8D77;</li>
<li>&#x5546;&#x52A1;&#x5408;&#x4F5C;&#xFF1A;&#x5982;&#x679C;&#x6709;&#x4F01;&#x4E1A;&#x57F9;&#x8BAD;&#xFF0C;&#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x62DB;&#x8058;&#x7B49;&#x5408;&#x4F5C;&#xFF0C;&#x4E5F;&#x8BF7;&#x76F4;&#x63A5;&#x8054;&#x7CFB;&#xFF0C;&#x5FAE;&#x4FE1;&#xFF1A;13552329235.</li>
</ul>
</li>
</ul>
<p>&#x6700;&#x540E;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5728;2017&#x64B8;&#x8D77;&#x8896;&#x5B50;&#x52A0;&#x6CB9;&#x5E72;&#x5427;~&#xFF01;&#xFF01;</p>

        <div class="copyright">Powered by <a href="https://github.com/jaywcjlove/idoc" target="_blank">idoc</a>. Dependence <a href="https://nodejs.org">Node.js</a> run.</div>
    </div>

</div>


</body>
<script src="http://cdn.bootcss.com/jquery/3.0.0/jquery.min.js"></script>
<script>
    $('.page-toc li').eq(0).children('a').addClass('red');
    var arr = [];
    $("h2,h3").each(function () {
        $(this).attr('t',$(this).position().top);
        arr.push($(this).position().top);
    });
    $(window).on('scroll', function () {
        var cur = $(document).scrollTop();
        for(var i = arr.length; i >=0;i--){
            if(arr[i]<=cur){
                break;
            }
        }
        if(i===-1){
            i = 0;
        }
        $('.page-toc li a').removeClass('red');
        $('.page-toc li').eq(i).children('a').addClass('red')
    });
</script>
</html>
