<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>MyTechBook</title>
        
    <link rel="stylesheet" type="text/css" href="../../static/css/main.css">
</head>
<body>
<div class="navbar navbar-line">
    <div class="container">
        <div class="logo">
            
                MyTechBook
            
        </div>
        <input type="checkbox" id="idoc_nav" />
        <div class="menu_tree">
        <ul><li><a href="../../index.html">首页</a></li><li><a href="#"><span></span>前沿观察</a><ul><li><a href="../../html/前沿观察/ECMAScript 6入门.html">ECMAScript 6入门</a></li><li><a href="../../html/前沿观察/Immutable详解及React中实践.html">Immutable详解及React中实践</a></li><li><a href="../../html/前沿观察/Node.js MVC框架ThinkJS.html">Node.js MVC框架ThinkJS</a></li><li><a href="../../html/前沿观察/Nodejs 5.0.0版本.html">Nodejs 5.0.0版本</a></li><li><a href="../../html/前沿观察/关系型数据库PostgreSQL.html">关系型数据库PostgreSQL</a></li><li><a href="../../html/前沿观察/轻型MVVM框架Vue.js.html">轻型MVVM框架Vue.js</a></li><li><a href="../../html/前沿观察/基于nodejs的开发框架koa.html">基于nodejs的开发框架koa</a></li></ul></li><li><a href="#"><span></span>前端工程化</a><ul><li><a href="../../html/前端工程化/前端模板.html">前端模板</a></li><li><a href="../../html/前端工程化/性能优化和前端工程的爱恨情仇.html">性能优化和前端工程的爱恨情仇</a></li><li><a href="../../html/前端工程化/webpack入门及实践.html">webpack入门及实践</a></li><li><a href="../../html/前端工程化/前端工程化不完全装逼指南.html">前端工程化不完全装逼指南</a></li></ul></li><li><a href="#"><span></span>性能优化</a><ul><li><a href="../../html/性能优化/jshint代码质量检测.html">jshint代码质量检测</a></li><li><a href="../../html/性能优化/jshint配置说明.html">jshint配置说明</a></li><li><a href="../../html/性能优化/NC性能优化.html">NC性能优化</a></li><li><a href="../../html/性能优化/React编码规范.html">React编码规范</a></li><li><a href="../../html/性能优化/性能优化待办事项.html">性能优化待办事项</a></li><li><a href="../../html/性能优化/性能优化点总结.html">性能优化点总结</a></li></ul></li><li><a href="#"><span></span>技术分享</a><ul><li><a href="../../html/技术分享/React技术分享.html">React技术分享</a></li><li><a href="../../html/技术分享/学习Git.html">学习Git</a></li><li class="active"><a href="../../html/技术分享/面向对象.html">面向对象</a></li><li><a href="../../html/技术分享/Node.js知识详解.html">Node.js知识详解</a></li><li><a href="../../html/技术分享/2015年大前端技术年终总结.html">2015年大前端技术年终总结</a></li></ul></li><li><a href="#"><span></span>随想笔记</a><ul><li><a href="../../html/随想笔记/项目技术栈规划.html">项目技术栈规划</a></li><li><a href="../../html/随想笔记/笔试面试大纲.html">笔试面试大纲</a></li></ul></li><li><a href="../../html/CONTACT.html">CONTACT</a></li></ul>    
        </div>
        
        
        <div class="forkgithub"><a target="_blank" href="https://github.com/GuoYongfeng">fork on github</a></div>
        

        <section class="idoc_nav_btn">
            <label for="idoc_nav"><span></span></label>
        </section>
    </div>
    
</div>




<div class="container">

    <div class="page-toc">
        <ul><li><a href="#t0面 向 对 象 和 数 组">面 向 对 象 和 数 组</a><ul><li><a href="#t11 对象">1 对象</a><ul><li><a href="#t21.1 初识对象">1.1 初识对象</a></li><li><a href="#t31.2 数据发展">1.2 数据发展</a></li><li><a href="#t41.3  对象的特点">1.3  对象的特点</a></li><li><a href="#t51.4  遍历对象">1.4  遍历对象</a></li></ul></li><li><a href="#t62 面向对象">2 面向对象</a><ul><li><a href="#t72.1 创建单一的一个对象">2.1 创建单一的一个对象</a></li><li><a href="#t82.2 批量生产对象的方式：工厂模式">2.2 批量生产对象的方式：工厂模式</a></li><li><a href="#t92.3 有区别的批量生成对象：构造函数">2.3 有区别的批量生成对象：构造函数</a></li><li><a href="#t102.4 兼顾以上二者的混合模式">2.4 兼顾以上二者的混合模式</a></li></ul></li><li><a href="#t113 数组基础">3 数组基础</a><ul><li><a href="#t123.1 数组定义">3.1 数组定义</a></li><li><a href="#t133.2 数组方法">3.2 数组方法</a><ul><li><a href="#t143.2.1 元素添加和删除">3.2.1 元素添加和删除</a></li><li><a href="#t153.2.2 slice和splice方法">3.2.2 slice和splice方法</a></li><li><a href="#t163.2.3 toString方法">3.2.3 toString方法</a></li><li><a href="#t173.2.4 排序方法">3.2.4 排序方法</a></li><li><a href="#t183.2.5 数组转换">3.2.5 数组转换</a></li><li><a href="#t193.2.6 位置方法（ECMA5的方法）">3.2.6 位置方法（ECMA5的方法）</a></li><li><a href="#t203.2.7 迭代方法（ECMA5的方法）">3.2.7 迭代方法（ECMA5的方法）</a></li><li><a href="#t213.2.8 缩小方法">3.2.8 缩小方法</a></li></ul></li></ul></li><li><a href="#t224 数组和面向对象">4 数组和面向对象</a><ul><li><a href="#t234.1数组和对象的关系">4.1数组和对象的关系</a></li><li><a href="#t244.2数组的前世今生">4.2数组的前世今生</a></li><li><a href="#t254.3 对象和数组的同源性">4.3 对象和数组的同源性</a></li><li><a href="#t264.4检测数组类型">4.4检测数组类型</a></li><li><a href="#t274.3数组方法模拟与扩展(深入理解prototype)">4.3数组方法模拟与扩展(深入理解prototype)</a><ul><li><a href="#t284.3.1 数组去重复的实现">4.3.1 数组去重复的实现</a></li><li><a href="#t294.3.2 数组克隆的实现">4.3.2 数组克隆的实现</a></li></ul></li></ul></li></ul></li></ul>
    </div>
    
    <div class="content markdown-body">
        <h1 id="t0&#x9762; &#x5411; &#x5BF9; &#x8C61; &#x548C; &#x6570; &#x7EC4;">&#x9762; &#x5411; &#x5BF9; &#x8C61; &#x548C; &#x6570; &#x7EC4; <a href="#t0&#x9762; &#x5411; &#x5BF9; &#x8C61; &#x548C; &#x6570; &#x7EC4;"> # </a></h1>
<h2 id="t11 &#x5BF9;&#x8C61;">1 &#x5BF9;&#x8C61; <a href="#t11 &#x5BF9;&#x8C61;"> # </a></h2>
<h3 id="t21.1 &#x521D;&#x8BC6;&#x5BF9;&#x8C61;">1.1 &#x521D;&#x8BC6;&#x5BF9;&#x8C61; <a href="#t21.1 &#x521D;&#x8BC6;&#x5BF9;&#x8C61;"> # </a></h3>
<p>&#x5BF9;&#x8C61;&#x5728;JavaScript&#x4E2D;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x7B3C;&#x7EDF;&#x7684;&#x79F0;&#x547C;&#xFF0C;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5728;&#x57FA;&#x7840;&#x8BFE;&#x7A0B;&#x4E2D;&#x8BB2;&#x4E86;&#x5355;&#x4E00;&#x7684;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>var n = 0;    //number&#x7C7B;&#x578B;
var b = true;    //boolean&#x7C7B;&#x578B;
var str = &apos;abc&apos;;    //string&#x7C7B;&#x578B;
</code></pre><p>&#x5728;Javasript&#x4E2D;&#xFF0C;&#x4E00;&#x5171;&#x6709;&#x4E94;&#x79CD;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;null&#xFF0C;undefined&#xFF0C;string&#xFF0C;boolean&#xFF0C;number&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x51E0;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x662F;&#x6309;&#x503C;&#x4F20;&#x9012;&#xFF0C;&#x6545;&#x800C;&#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x503C;&#x7C7B;&#x578B;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x5B83;&#x4EEC;&#x90FD;&#x8868;&#x793A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x3002;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x53EA;&#x8868;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5B83;&#x5BF9;&#x5E94;&#x7684;&#x53D8;&#x91CF;&#x4E5F;&#x662F;&#x53EA;&#x4FDD;&#x5B58;&#x4E86;&#x8FD9;&#x4E00;&#x4E2A;&#x503C;&#x3002;&#x5C31;&#x662F;&#x8BF4;i=3&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#xFF0C;3&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x6570;&#xFF0C;&#x90A3;&#x4E48;i&#x4E5F;&#x53EA;&#x4FDD;&#x5B58;&#x4E86;3&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x503C;&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#xFF1A;null&#x548C;undefined&#x5176;&#x5B9E;&#x5C5E;&#x6027;&#x6807;&#x8BC6;&#x6027;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5F52;&#x5230;&#x503C;&#x7C7B;&#x578B;&#x6216;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x51C6;&#x786E;&#x3002;</p>
</blockquote>
<h3 id="t31.2 &#x6570;&#x636E;&#x53D1;&#x5C55;">1.2 &#x6570;&#x636E;&#x53D1;&#x5C55; <a href="#t31.2 &#x6570;&#x636E;&#x53D1;&#x5C55;"> # </a></h3>
<p>&#x4F46;&#x968F;&#x7740;&#x6570;&#x636E;&#x7684;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#x63D0;&#x9AD8;&#xFF0C;&#x5355;&#x4E00;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x5DF2;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x7F16;&#x7A0B;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x4FBF;&#x4EA7;&#x751F;&#x4E86;&#x7528;&#x5355;&#x4E00;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x6570;&#x636E;&#xFF08;&#x6216;&#x590D;&#x5408;&#x6570;&#x636E;&#xFF09;&#x53BB;&#x63CF;&#x8FF0;&#x7684;&#x590D;&#x5408;&#x578B;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E2A;&#x590D;&#x5408;&#x6570;&#x636E;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x6570;&#x636E;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x5DE5;&#x4F5C;&#xFF0C;&#x65B9;&#x4FBF;&#x7F16;&#x7A0B;&#xFF0C;&#x6709;&#x4E86;&#x590D;&#x5408;&#x578B;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>var obj = {
     name:&apos;rose&apos;,
     age:22,
     height:180,
     write:function(){ console.log(&apos;i can program&apos;)}
};
</code></pre><p>&#x4EE5;&#x4E0A;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x590D;&#x5408;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4EE5;&#x952E;&#x503C;&#x5BF9;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x7531;&#x4E8E;&#x590D;&#x5408;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x662F;&#x6309;&#x5F15;&#x7528;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF08;Object&#xFF0C;Array&#xFF0C;Date&#xFF0C;RegExp&#xFF0C;Function&#xFF09;&#x3002;&#x800C;ECMA-262&#x4F7F;&#x7528;&#x4E13;&#x4E1A;&#x672F;&#x8BED;&#x8BCD;&#x6C47;&#x5C06;&#x5BF9;&#x8C61;&#x5B9A;&#x4E49;&#x4E3A;&#x201C;&#x65E0;&#x5E8F;&#x5C5E;&#x6027;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5176;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x57FA;&#x672C;&#x503C;&#x3001;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x51FD;&#x6570;&#x201D;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x952E;&#x503C;&#x5BF9;&#x6765;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#xFF0C;&#x5BF9;&#x8C61;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7528;&#x4E8E;&#x5C06;&#x591A;&#x79CD;&#x6570;&#x636E;&#x6216;&#x529F;&#x80FD;&#xFF08;&#x6216;&#x53EB;&#x51FD;&#x6570;&#x6216;&#x65B9;&#x6CD5;&#xFF09;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5176;&#x5B9E;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x7684;&#x610F;&#x4E49;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x628A;&#x591A;&#x4E2A;&#x503C;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x8FD9;&#x4E9B;&#x96C6;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x503C;&#x4E4B;&#x95F4;&#x8FD8;&#x6709;&#x5173;&#x8054;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x503C;&#x4E5F;&#x662F;&#x5BF9;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6570;&#x636E;&#x7684;&#x6574;&#x4F53;&#x63CF;&#x8FF0;&#xFF0C;&#x5373;&#x7528;&#x6570;&#x636E;&#x6765;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x3002;
&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;obj&#x770B;&#x505A;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5728;&#x5185;&#x5B58;&#x5757;&#x4E2D;&#x53C8;&#x5212;&#x5206;&#x4E86;&#x82E5;&#x5E72;&#x4E2A;&#x5C0F;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x7528;&#x6765;&#x5B58;&#x653E;obj&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7406;&#x89E3;&#x7684;&#x3002;</p>
<h3 id="t41.3  &#x5BF9;&#x8C61;&#x7684;&#x7279;&#x70B9;">1.3  &#x5BF9;&#x8C61;&#x7684;&#x7279;&#x70B9; <a href="#t41.3  &#x5BF9;&#x8C61;&#x7684;&#x7279;&#x70B9;"> # </a></h3>
<ul>
<li>&#x53EF;&#x4EE5;&#x590D;&#x5408;&#x5B58;&#x503C;&#xFF0C;&#x5B58;&#x5F88;&#x591A;&#x503C;&#xFF1B;</li>
<li>&#x952E;&#x548C;&#x503C;&#x5BF9;&#x672C;&#x8EAB;&#x662F;&#x5BF9;obj&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x662F;&#x63CF;&#x8FF0;&#x4E86;obj&#x8FD9;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x5F81;&#xFF1B;</li>
<li>&#x4E0D;&#x540C;&#x7684;&#x5C5E;&#x6027;&#x4E4B;&#x95F4;&#x4E5F;&#x662F;&#x6709;&#x5173;&#x7CFB;&#x7684;&#xFF0C;&#x6709;&#x5173;&#x8054;&#x7684;&#x3002;&#x5982;&#xFF1A;&#x6570;&#x7EC4;&#x7684;length&#x5C5E;&#x6027;&#xFF0C;&#x6570;&#x7EC4;&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x5C5E;&#x6027;&#x7684;&#x5B58;&#x503C;&#x4E2A;&#x6570;&#x3002;&#x5C5E;&#x6027;&#x4E4B;&#x95F4;&#x4E5F;&#x662F;&#x6709;&#x5173;&#x8054;&#x7684;&#x3002;</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x8FD9;&#x79CD;&#x7279;&#x70B9;&#xFF0C;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x590D;&#x5408;&#x7684;&#x5B8C;&#x6574;&#x6570;&#x636E;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x6765;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>var web_engineer = {
    name:&apos;&apos;,
    age:30,
    js:function(){ console.log(&apos;javascript&apos;)},
    css:function(){ console.log(&apos;css&apos;)}
};
</code></pre><h3 id="t51.4  &#x904D;&#x5386;&#x5BF9;&#x8C61;">1.4  &#x904D;&#x5386;&#x5BF9;&#x8C61; <a href="#t51.4  &#x904D;&#x5386;&#x5BF9;&#x8C61;"> # </a></h3>
<p>&#x904D;&#x5386;&#x5BF9;&#x8C61;&#x7684;&#x503C;&#xFF0C;&#x7528;for...in&#xFF1A;</p>
<pre><code>for(var attr in web_engineer){
    alert(attr);    //&#x83B7;&#x53D6;&#x5C5E;&#x6027;
    alert(web_engineer[attr]);    //&#x83B7;&#x53D6;&#x503C;
    alert(web_engineer.attr);    //&#x83B7;&#x53D6;&#x503C;&#x7684;&#x53E6;&#x4E00;&#x65B9;&#x5F0F;&#xFF0C;&#x6027;&#x80FD;&#x597D;&#xFF0C;&#x4F46;&#x4E0D;&#x591F;&#x7075;&#x6D3B;
}
</code></pre><p>&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4F9D;&#x6B21;&#x6309;&#x987A;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x5C5E;&#x6027;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x5C5E;&#x6027;&#x503C;&#xFF0C;&#x8FD9;&#x79CD;&#x4EE5;&#x5B57;&#x7B26;&#x5F62;&#x5F0F;&#x7684;&#x5BF9;&#x8C61;&#x904D;&#x5386;&#x8F93;&#x51FA;&#x662F;&#x6CA1;&#x6709;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x7684;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4F1A;&#x6709;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;----&#x4EE5;&#x6570;&#x5B57;&#x4E3A;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5728;chrome&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x904D;&#x5386;&#x65F6;&#x4F1A;&#x5C06;&#x5C5E;&#x6027;&#x4E3A;&#x6570;&#x5B57;&#x7684;&#x503C;&#x4F18;&#x5148;&#x8F93;&#x51FA;&#x3002;&#x5982;&#xFF1A;</p>
<pre><code>var person1 = {
    name:&apos;somebody&apos;,
    age:22,
    0:&apos;number1&apos;,
    1:&apos;number2&apos;
};
</code></pre><p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;person1[0]&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#x503C;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x4E8E;&#x6570;&#x7EC4;&#x7684;&#x5BF9;&#x8C61;&#x7ED3;&#x6784;&#xFF0C;&#x79F0;&#x4E3A;&#x7C7B;&#x6570;&#x7EC4;&#xFF0C;&#x5728;&#x540E;&#x9762;&#x4F1A;&#x8BE6;&#x7EC6;&#x7684;&#x8BF4;&#x5230;&#x3002;</p>
<h2 id="t62 &#x9762;&#x5411;&#x5BF9;&#x8C61;">2 &#x9762;&#x5411;&#x5BF9;&#x8C61; <a href="#t62 &#x9762;&#x5411;&#x5BF9;&#x8C61;"> # </a></h2>
<p>&#x52A0;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;&#x5BF9;&#x8C61;&#x548C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x793E;&#x4F1A;&#x751F;&#x4EA7;&#x4E2D;&#x5546;&#x54C1;&#xFF08;&#x7269;&#x54C1;&#xFF09;&#x548C;&#x751F;&#x6210;&#x5546;&#x54C1;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x91CA;
&#x6CE8;&#xFF1A;&#x8FD9;&#x91CC;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#xFF0C;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0A;&#x8BFE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x7406;&#x89E3;&#x597D;&#x8FD9;&#x4E2A;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x53EB;&#x201C;&#x521B;&#x5EFA;&#x578B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x662F;&#x8BF8;&#x591A;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x4E00;&#x79CD;</p>
<h3 id="t72.1 &#x521B;&#x5EFA;&#x5355;&#x4E00;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;">2.1 &#x521B;&#x5EFA;&#x5355;&#x4E00;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61; <a href="#t72.1 &#x521B;&#x5EFA;&#x5355;&#x4E00;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;"> # </a></h3>
<p> &#x5728;&#x524D;&#x7AEF;&#x53D1;&#x5C55;&#x65E9;&#x671F;&#xFF0C;&#x516C;&#x53F8;&#x82E5;&#x9700;&#x8981;&#x62DB;&#x8058;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x62DB;&#x8058;&#x7684;&#x4EBA;&#x624D;&#x7279;&#x70B9;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;obj&#x5BF9;&#x8C61;&#x6765;&#x63CF;&#x8FF0;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x8FD9;&#x79CD;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x91CF;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;&#x4E00;&#x822C;&#x5730;&#xFF0C;&#x5F53;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9002;&#x5408;&#x7528;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x91CF;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;&#x4F46;&#x9EBB;&#x70E6;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x62DB;&#x8058;&#x4E00;&#x4E07;&#x4E2A;&#x524D;&#x7AEF;&#x4EBA;&#x624D;&#xFF0C;&#x5219;&#x6BCF;&#x62DB;&#x8058;&#x4E00;&#x6B21;&#x5C31;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x6837;&#x6548;&#x7387;&#x5C31;&#x4E0D;&#x9AD8;&#x4E86;&#x3002;
&#x66F4;&#x5F62;&#x8C61;&#x5730;&#x8BF4;&#xFF0C;&#x5728;5000&#x5E74;&#x524D;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4EF6;&#x864E;&#x76AE;&#x5927;&#x8863;&#xFF0C;&#x90A3;&#x4E48;&#x9996;&#x5148;&#x9700;&#x8981;&#x5148;&#x6253;&#x4E2A;&#x8001;&#x864E;&#x53D6;&#x5F97;&#x864E;&#x76AE;&#x4F5C;&#x4E3A;&#x539F;&#x6750;&#x6599;&#xFF0C;&#x518D;&#x7EAF;&#x624B;&#x5DE5;&#x7F1D;&#x5236;&#xFF0C;&#x624D;&#x80FD;&#x5236;&#x4F5C;&#x51FA;&#x4E00;&#x4EF6;&#x7EAF;&#x6B63;&#x7684;&#x864E;&#x76AE;&#x5927;&#x8863;&#x6210;&#x54C1;&#x3002;</p>
<pre><code>//&#x5BF9;&#x8C61;&#xFF0C;&#x7269;&#x4EF6;&#xFF0C;&#x4EA7;&#x54C1;
//&#x864E;&#x76AE;&#x5927;&#x8863;
var shirt = {
    //&#x624B;&#x5DE5;&#xFF0C;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;
};
</code></pre><blockquote>
<p>&#x5C0F;&#x7ED3;&#xFF1A;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#x662F;&#x5F88;&#x843D;&#x540E;&#x7684;&#x3002;&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x5728;js&#x4E2D;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x7EAF;&#x7CB9;&#x7684;&#x7528;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x91CF;&#x6765;&#x5355;&#x6B21;&#x7684;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#x975E;&#x5E38;&#x7684;&#x4E0D;&#x65B9;&#x4FBF;&#xFF0C;&#x9700;&#x8981;&#x6539;&#x8FDB;&#x8FD9;&#x79CD;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x8FD9;&#x79CD;&#x843D;&#x540E;&#x7684;&#x201C;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#x201D; &#x3002;
&#x52A0;&#xFF1A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x7684;&#x4F5C;&#x7528;</p>
<h3 id="t82.2 &#x6279;&#x91CF;&#x751F;&#x4EA7;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;">2.2 &#x6279;&#x91CF;&#x751F;&#x4EA7;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x5DE5;&#x5382;&#x6A21;&#x5F0F; <a href="#t82.2 &#x6279;&#x91CF;&#x751F;&#x4EA7;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;"> # </a></h3>
</blockquote>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x4E00;&#x4E2A;&#x9762;&#x5305;&#x5DE5;&#x5382;&#x751F;&#x4EA7;&#x9762;&#x5305;&#x7684;&#x6D41;&#x7A0B;&#x548C;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5728;&#x5BB6;&#x505A;&#x9762;&#x5305;&#x7684;&#x6D41;&#x7A0B;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5728;&#x5BB6;&#x624B;&#x5DE5;&#x5236;&#x4F5C;&#x9762;&#x5305;&#x7684;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x5DE5;&#x5382;&#x91CC;&#x9762;&#x5C06;&#x751F;&#x4EA7;&#x9762;&#x5305;&#x7684;&#x6D41;&#x7A0B;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x8FDB;&#xFF0C;&#x53EF;&#x4EE5;&#x6279;&#x91CF;&#x5730;&#x751F;&#x4EA7;&#x4E86;&#x3002;&#x800C;&#x5DE5;&#x5382;&#x662F;&#x5BF9;&#x751F;&#x4EA7;&#x5BF9;&#x8C61;&#x7684;&#x6D41;&#x7A0B;&#x7684;&#x5F52;&#x7EB3;&#xFF0C;&#x6216;&#x8005;&#x53EB;&#x505A;&#x5C01;&#x88C5;&#xFF0C;&#x8FD9;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3002;&#x6240;&#x4EE5;&#x539F;&#x6765;&#x53EB;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#xFF0C;&#x73B0;&#x5728;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x548C;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x533A;&#x522B;&#xFF1A;&#x751F;&#x4EA7;&#x6D41;&#x7A0B;&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#x7684;&#x6539;&#x53D8;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x5C31;&#x662F;&#x751F;&#x4EA7;&#x5BF9;&#x8C61;&#xFF08;&#x5BF9;&#x8C61;&#x662F;&#x7269;&#x4EF6;&#x6216;&#x662F;&#x4EA7;&#x54C1;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x6539;&#x8FDB;&#x4E86;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x751F;&#x4EA7;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x56DE;&#x5230;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x73B0;&#x5728;&#x793E;&#x4F1A;&#x4E0A;&#x9700;&#x8981;&#x5F88;&#x591A;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x6279;&#x91CF;&#x7684;&#x62DB;&#x8058;&#xFF0C;&#x9700;&#x6C42;&#x91CF;&#x5F88;&#x5927;&#xFF0C;&#x4F46;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x4EBA;&#x624D;&#x6570;&#x91CF;&#x4E0D;&#x8DB3;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x57F9;&#x517B;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x6D41;&#x7A0B;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x6279;&#x91CF;&#x7684;&#x57F9;&#x8BAD;&#x51FA;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#xFF1A;</p>
<pre><code>function FE(){//&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x89C4;&#x8303;
   var obj = {};//&#x8FD9;&#x4E2A;&#x6CE8;&#x91CA;&#x4F1A;&#x5F15;&#x8D77;&#x8BEF;&#x89E3;&#xFF0C;&#x53BB;&#x6389;&#xFF1A;&#x751F;&#x4EA7;&#x539F;&#x6599;
   obj.name = &apos;&apos;;    //&#x52A0;&#x5DE5;&#x8FC7;&#x7A0B;
   obj.age = &apos;&apos;;
   obj.writeCss = function(){ console.log(&apos;css&apos;)};
   obj.writeJs = function(){ console.log(&apos;js&apos;)};
   return obj;    //&#x751F;&#x4EA7;&#x51FA;&#x6765;&#x7684;&#x4EA7;&#x54C1;
}
var a = [];
for(var i = 0;i&lt;30;i++){
    a.push(FE(i));//&#x6309;&#x7740;&#x8FD9;&#x4E2A;&#x89C4;&#x8303;&#xFF0C;&#x7528;&#x5FAA;&#x73AF;&#x6279;&#x91CF;&#x521B;&#x5EFA;
}
</code></pre><p>&#x73B0;&#x5728;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x57F9;&#x517B;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C06;&#x65B9;&#x6CD5;&#x5FAA;&#x73AF;30&#x6B21;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x751F;&#x4EA7;&#x51FA;30&#x4E2A;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x901A;&#x8FC7;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;&#x5C06;&#x8FD9;&#x79CD;&#x5177;&#x4F53;&#x7684;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#x62BD;&#x8C61;&#x51FA;&#x4E00;&#x4E2A;&#x751F;&#x4EA7;&#x7684;&#x6D41;&#x7A0B;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x6709;&#x5F88;&#x591A;&#x7F8A;&#x6BDB;&#xFF0C;&#x9700;&#x8981;&#x6279;&#x91CF;&#x751F;&#x4EA7;&#x51FA;&#x5F88;&#x591A;&#x7F8A;&#x6BDB;&#x886B;&#xFF1A;</p>
<pre><code>function factory(material){//&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x751F;&#x4EA7;&#x7684;&#x6D41;&#x7A0B;&#xFF08;&#x6216;&#x53EB;&#x89C4;&#x8303;&#x4E5F;&#x884C;&#xFF09;
    var obj = {};
    obj.material = meterial;//&#x539F;&#x6599;
    obj.attr1 = &apos;&apos;;
    obj.attr2 = &apos;&apos;;
    obj.fn = function(){};//&#x6BD4;&#x5982;&#x7F8A;&#x6BDB;&#x886B;&#x8FD8;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x5219;&#x5C31;&#x662F;&#x51FD;           &#x6570;&#x578B;&#x7684;&#x5C5E;&#x6027;&#x4E86;
    return obj;//&#x751F;&#x4EA7;&#x5B8C;&#x6210;&#xFF0C;&#x51FA;&#x4EA7;&#x54C1;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#x8FD4;&#x56DE;
}
</code></pre><p>&#x8FD9;&#x79CD;&#x62BD;&#x8C61;&#x51FA;&#x7684;&#x751F;&#x4EA7;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#xFF0C;&#x662F;&#x5BF9;&#x539F;&#x6765;&#x624B;&#x5DE5;&#x751F;&#x4EA7;&#x7F8A;&#x6BDB;&#x886B;&#x7684;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x539F;&#x6765;&#x53EB;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#xFF0C;&#x73B0;&#x5728;&#x5C31;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E86;&#x3002;&#x6240;&#x8C13;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x751F;&#x4EA7;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x73B0;&#x5728;&#x8FD9;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</p>
<blockquote>
<p>&#x5C0F;&#x7ED3;&#xFF1A;&#x901A;&#x8FC7;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5927;&#x6279;&#x91CF;&#x7684;&#x751F;&#x4EA7;&#x7269;&#x54C1;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x7F3A;&#x70B9;&#xFF0C;&#x5728;&#x5546;&#x54C1;&#x77ED;&#x7F3A;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x6279;&#x91CF;&#x51FA;&#x6765;&#x7684;&#x53EF;&#x4EE5;&#x7545;&#x9500;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x5728;&#x751F;&#x4EA7;&#xFF0C;&#x7ADE;&#x4E89;&#x52A0;&#x5267;&#x4E86;&#xFF0C;&#x4EA7;&#x54C1;&#x4E30;&#x5BCC;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x5F97;&#x63D0;&#x9AD8;&#x54C1;&#x724C;&#x8BC6;&#x522B;&#xFF0C;&#x8D34;&#x724C;&#x4E86;&#xFF0C;&#x52A0;&#x4E0A;&#x5546;&#x6807;&#xFF0C;&#x6765;&#x52A0;&#x5F3A;&#x7ADE;&#x4E89;&#x529B;&#x3002;&#x8FD9;&#x5C31;&#x4E0D;&#x80FD;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x5546;&#x54C1;&#x533A;&#x522B;&#x5F00;&#x6765;&#xFF0C;&#x63D0;&#x9AD8;&#x4EA7;&#x54C1;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#x3002;&#x4EA7;&#x54C1;&#x5DEE;&#x5F02;&#xFF0C;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x53EB;&#x5B9E;&#x4F8B;&#x8BC6;&#x522B;&#xFF0C;&#x5176;&#x5B9E;&#x610F;&#x601D;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x3002;&#x4EA7;&#x54C1;&#x5DEE;&#x5F02;&#x7684;&#x4F53;&#x73B0;&#xFF1A;&#x540C;&#x6837;&#x662F;&#x624B;&#x673A;&#xFF0C;&#x82F9;&#x679C;&#x66F4;&#x8D35;&#x5C0F;&#x7C73;&#x5C31;&#x4FBF;&#x5B9C;&#xFF1B;&#x540C;&#x6837;&#x662F;&#x6C7D;&#x8F66;&#xFF0C;&#x5B9D;&#x9A6C;&#x66F4;&#x8D35;&#x800C;&#x590F;&#x5229;&#x5C31;&#x4FBF;&#x5B9C;&#x3002;&#x8FD9;&#x79CD;&#x4EA7;&#x54C1;&#x7684;&#x5DEE;&#x5F02;&#x6027;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x5B9E;&#x4F8B;&#x8BC6;&#x522B;&#x3002;&#x60F3;&#x8981;&#x89E3;&#x51B3;&#x5B9E;&#x4F8B;&#x8BC6;&#x522B;&#x7684;&#x95EE;&#x9898;&#x5219;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x4E86;&#x3002;</p>
</blockquote>
<h3 id="t92.3 &#x6709;&#x533A;&#x522B;&#x7684;&#x6279;&#x91CF;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#xFF1A;&#x6784;&#x9020;&#x51FD;&#x6570;">2.3 &#x6709;&#x533A;&#x522B;&#x7684;&#x6279;&#x91CF;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#xFF1A;&#x6784;&#x9020;&#x51FD;&#x6570; <a href="#t92.3 &#x6709;&#x533A;&#x522B;&#x7684;&#x6279;&#x91CF;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#xFF1A;&#x6784;&#x9020;&#x51FD;&#x6570;"> # </a></h3>
<p>&#x4EE5;&#x5F88;&#x6709;&#x4E2A;&#x6027;&#x7684;360&#x516C;&#x53F8;&#x4E3A;&#x6A21;&#x677F;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>function FE360(name, age){
    this.name = name;
    this.age = age;
    this.writeCss = function(){};
    this.writeJs = function(){};
}
</code></pre><p>&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x5BF9;&#x6BD4;&#xFF1A;</p>
<ul>
<li>&#x66F4;&#x7B80;&#x5355;&#x4E86;</li>
<li>&#x5C11;&#x4E86;&#x5BF9;obj&#x5BF9;&#x8C61;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4E0D;&#x7528;new Object</li>
<li>&#x5C11;&#x4E86;return&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x503C;</li>
<li>&#x7528;&#x6CD5;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x6709;&#x533A;&#x522B;&#xFF0C;&#x73B0;&#x5728;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x4E86;&#xFF0C;&#x9700;&#x8981;new&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x7528;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</li>
</ul>
<pre><code>var person2 = new FE360(&apos;someone&apos;, 24);
person2.age;
person2.name;
person2.writeCss();
//&#x8FD9;&#x6837;&#x5C31;&#x83B7;&#x5F97;&#x4E86;&#x6709;&#x4E2A;&#x6027;&#x7684;360&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5B9E;&#x4F8B;
</code></pre><p>&#x8FD9;&#x91CC;&#x7684;person2&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x8FD8;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;FE360&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x662F;&#x5C5E;&#x4E8E;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x4E86;&#xFF0C;FE360&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x51FD;&#x6570;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F8B;&#xFF1A;</p>
<pre><code>var person3 = new FE360(&apos;person3&apos;, 26);
var person4 = new FE360(&apos;person4&apos;, 34);
//&#x8FD9;&#x6837;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x5B9E;&#x4F8B;&#x7684;&#x95EE;&#x9898;
//Function&#x7684;&#x7279;&#x6B8A;&#x6027;&#xFF1A;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x7C7B;&#x8FD8;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x4E3B;&#x8981;&#x5728;&#x4E8E;new&#x7684;&#x51FA;&#x73B0;
</code></pre><p>&#x5F53;new&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;new&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#xFF1A;</p>
<ol>
<li>&#x9996;&#x5148;&#x4F1A;&#x4E3B;&#x52A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x662F;&#x5F53;&#x524D;&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x4EE5;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x540D;&#x4E3A;&#x8BC6;&#x522B;&#x7B26;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x53EF;&#x4EE5;&#x7528;instanceof&#x6765;&#x68C0;&#x9A8C;&#x4E00;&#x4E0B;&#xFF1A;
alert(person2 instanceof FE360);</li>
<li>&#x4EE5;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E3A;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;context&#xFF0C;this&#xFF0C;&#x5F53;&#x524D;&#x884C;&#x4E3A;&#x53D1;&#x751F;&#x7684;&#x90A3;&#x4E2A;&#x4E3B;&#x4F53;&#xFF09;&#xFF0C;&#x518D;&#x628A;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8D77;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x5B9E;&#x4F8B;&#x7684;&#x4F5C;&#x7528;</li>
<li>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9E;&#x4F8B;&#x6765;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x4E86;</li>
</ol>
<pre><code>function FE360(name, age){
    this.name = name;
    this.age = age;
    this.writeCss =function(){ alert(&apos;&#x6211;&#x53EB;&apos;+this.name+&apos;,&#x6211;&#x4F1A;&#x5199;css&apos;); };
    this.writeJs = function(){ alert(&apos;&#x6211;&#x53EB;&apos;+this.name+&apos;,&#x6211;&#x4F1A;&#x5199;js&apos;); };
}

person2.writeCss();
person2.writeJs();
</code></pre><blockquote>
<p>&#x5C0F;&#x7ED3;&#xFF1A;&#x5BF9;&#x8C61;&#x672C;&#x6765;&#x662F;&#x5F88;&#x7B3C;&#x7EDF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x73B0;&#x5728;person2&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x5F53;&#x524D;FE360&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x7EC6;&#x5206;&#x5316;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x662F;&#x751F;&#x4EA7;&#x6A21;&#x5F0F;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x539F;&#x6765;&#x751F;&#x4EA7;&#x7684;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5C06;&#x5546;&#x54C1;&#x533A;&#x5206;&#x5F00;&#x6765;&#x4E86;&#x3002;&#x6B63;&#x5982;&#x793E;&#x4F1A;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5BF9;&#x793E;&#x4F1A;&#x89D2;&#x8272;&#x7684;&#x533A;&#x5206;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x7EC6;&#x5316;&#x3002;</p>
</blockquote>
<ul>
<li>&#x8865;&#x5145;1&#xFF1A;&#x5BF9;&#x8C61;&#x3001;&#x7C7B;&#x548C;&#x5B9E;&#x4F8B;&#x7684;&#x533A;&#x5206;</li>
</ul>
<p>&#x5BF9;&#x8C61;&#x662F;&#x4E07;&#x4E8B;&#x4E07;&#x7269;&#xFF0C;&#x7C7B;&#x662F;&#x5BF9;&#x4E07;&#x4E8B;&#x4E07;&#x7269;&#x7684;&#x7EC6;&#x5206;&#x548C;&#x533A;&#x522B;&#xFF0C;&#x5B9E;&#x4F8B;&#x662F;&#x7C7B;&#x7684;&#x5177;&#x4F53;&#x5316;&#xFF0C;&#x518D;&#x6709;&#x4EC0;&#x4E48;&#x529F;&#x80FD;&#x6216;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x518D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6269;&#x5C55;&#x5C31;&#x884C;&#x3002;</p>
<ul>
<li>&#x8865;&#x5145;2&#xFF1A;&#x6570;&#x636E;&#x4E0D;&#x5355;&#x5355;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x6570;&#x636E;&#x4E5F;&#x6709;&#x529F;&#x80FD;</li>
</ul>
<p>&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4EBA;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7684;&#x503C;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5F88;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4F1A;&#x4E0A;&#x8BFE;&#x4F1A;&#x6363;&#x4E71;&#x3002;&#x6570;&#x636E;&#x7684;&#x8303;&#x56F4;&#x5F88;&#x5E7F;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4F53;&#x3002;Function&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x51FD;&#x6570;&#xFF08;function&#xFF09;&#x4E5F;&#x662F;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5C11;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#xFF08;prototype),&#x4E00;&#x5B9A;&#x8981;&#x52A0;&#x4E0A;
&#x4E0D;&#x91CD;&#x590D;&#x5236;&#x9020;&#x8F6E;&#x5B50;&#x7684;&#x539F;&#x5219;&#xFF1A;&#x539F;&#x578B;&#x6A21;&#x5F0F;</p>
<h3 id="t102.4 &#x517C;&#x987E;&#x4EE5;&#x4E0A;&#x4E8C;&#x8005;&#x7684;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;">2.4 &#x517C;&#x987E;&#x4EE5;&#x4E0A;&#x4E8C;&#x8005;&#x7684;&#x6DF7;&#x5408;&#x6A21;&#x5F0F; <a href="#t102.4 &#x517C;&#x987E;&#x4EE5;&#x4E0A;&#x4E8C;&#x8005;&#x7684;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;"> # </a></h3>
<blockquote>
<p>&#x6CE8;&#xFF1A;&#x8FD9;&#x91CC;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#xFF0C;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x53EB;&#x201C;&#x521B;&#x5EFA;&#x578B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x662F;&#x8BF8;&#x591A;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x4E00;&#x79CD;</p>
</blockquote>
<p>&#x79C1;&#x6709;&#x5C5E;&#x6027;&#x548C;&#x5171;&#x6709;&#x5C5E;&#x6027;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E0A;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x79C1;&#x6709;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x5403;&#x996D;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4F1A;&#xFF0C;&#x8FD9;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x6709;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x662F;&#x4E0A;&#x5E1D;&#x5C31;&#x521B;&#x9020;&#x597D;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x540E;&#x5929;&#x57F9;&#x517B;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5B9E;&#x4F8B;&#x8BC6;&#x522B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x672C;&#x7740;&#x7F16;&#x7A0B;&#x7684;&#x590D;&#x7528;&#x539F;&#x5219;&#xFF0C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6A21;&#x5F0F;&#x5374;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x590D;&#x7528;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5185;&#x5B9A;&#x4E49;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x79C1;&#x6709;&#x5C5E;&#x6027;&#xFF0C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x4F8B;&#x4E4B;&#x95F4;&#x65E0;&#x6CD5;&#x53BB;&#x5171;&#x4EAB;&#x4E00;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002;
&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>alert(person3.writeCss() == person4.writeCss);
//&#x8FD9;&#x91CC;alert&#x51FA;&#x73B0;&#x7684;&#x7ED3;&#x679C;&#x662F;false&#xFF0C;&#x8BF4;&#x660E;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;
</code></pre><p>&#x90A3;&#x600E;&#x4E48;&#x8BA9;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F8B;&#x53BB;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x5462;&#xFF0C;Js&#x7684;&#x539F;&#x578B;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;js&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x6838;&#x5FC3;&#x70B9;&#x3002;
&#x4E0B;&#x9762;&#x4F7F;&#x7528;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x65B0;&#x6A21;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>function FE360(name, age){
    this.name = name;
    this.age = age;
}
//&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#x5C31;&#x53D1;&#x751F;&#x4E86;&#x8D28;&#x7684;&#x53D8;&#x5316;
FE360.prototype.writeJs = function(){
    alert(&apos;&#x6211;&#x53EB;&apos;+this.name+&apos;,&#x6211;&#x4F1A;&#x5199;js&apos;);
};
FE360.prototype.writeCss = function(){
     alert(&apos;&#x6211;&#x53EB;&apos;+this.name+&apos;,&#x6211;&#x4F1A;&#x5199;css&apos;);
};
var person3 = new FE360(&apos;person3&apos;, 26);
var person4 = new FE360(&apos;person4&apos;, 34);
</code></pre><p>&#x73B0;&#x5728;&#x5728;&#x539F;&#x578B;&#x4E0A;&#x5B9A;&#x4E49;&#x4E86;&#x9700;&#x8981;&#x5171;&#x4EAB;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x6B21;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x5728;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#x5B9E;&#x4F8B;person3&#x548C;person4&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x4E00;&#x6837;&#xFF1A;</p>
<pre><code>alert(person3.writeCss() == person4.writeCss);    //&#x5F39;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;true
</code></pre><p>&#x8FD9;&#x8BF4;&#x660E;person3&#x548C;person4&#x4E0A;&#x7684;writeCss&#x65B9;&#x6CD5;&#x6307;&#x5411;&#x7684;&#x662F;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x5B9A;&#x4E49;&#x591A;&#x5C11;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5B9E;&#x4F8B;&#x4E0A;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x4E86;&#x3002;</p>
<p>&#x539F;&#x578B;&#x662F;&#x4EFB;&#x4F55;&#x65B9;&#x6CD5;&#x5929;&#x751F;&#x5C31;&#x6709;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x53EA;&#x6709;&#x5C06;&#x65B9;&#x6CD5;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x539F;&#x578B;&#x624D;&#x6709;&#x4F5C;&#x7528;&#xFF0C;&#x628A;&#x65B9;&#x6CD5;&#x5F53;&#x6210;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x65B9;&#x6CD5;&#x6765;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x539F;&#x578B;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x3002;&#x73B0;&#x5728;&#x5C06;&#x4EE5;&#x4E0A;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x5206;&#x89E3;&#xFF0C;&#x6F14;&#x793A;&#x539F;&#x578B;&#x7684;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#xFF0C;&#x5982;&#x56FE;1&#x6240;&#x793A;&#xFF1A;</p>
<p>&#x56FE; 1 &#x539F;&#x578B;&#x7684;&#x5B9E;&#x73B0;&#x673A;&#x5236;
 &#x521B;&#x5EFA;&#x5B8C;&#x5BF9;&#x8C61;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x6CA1;&#x6709;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#xFF0C;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;<strong>proto</strong>&#xFF08;&#x8FD9;&#x91CC;&#x662F;&#x4E24;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x4E0A;&#x90FD;&#x6709;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x662F;&#x5929;&#x751F;&#x7684;&#x539F;&#x578B;&#x673A;&#x5236;&#xFF0C;&#x4F1A;&#x6307;&#x5411;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x3002;&#x800C;&#x5728;person1&#x4E2D;&#x5B9A;&#x4E49;&#x7684;name&#x548C;age&#x662F;&#x5B83;&#x7684;&#x79C1;&#x6709;&#x5C5E;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x79C1;&#x6709;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x627E;&#x4E0D;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5C31;&#x4F1A;&#x5F80;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x9010;&#x7EA7;&#x5F80;&#x4E0A;&#x627E;&#x3002;
&#x628A;&#x539F;&#x578B;&#x94FE;&#x5C55;&#x5F00;&#x6765;&#x5199;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x628A;JS&#x662F;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7EE7;&#x627F;&#x7684;&#x8FD9;&#x4E00;&#x7279;&#x70B9;&#x5199;&#x6E05;&#x695A;&#x3002;&#x5C3D;&#x91CF;&#x914D;&#x4E0A;&#x56FE;&#x3002;&#x8981;&#x6C42;&#x6709;&#x56FE;&#x6709;&#x771F;&#x76F8;</p>
<blockquote>
<p>&#x603B;&#x7ED3;&#xFF1A;
&#x52A0;&#x4E0A;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x7406;&#x89E3;&#x4E3A;&#x751F;&#x6210;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x4E0A;&#x89E3;&#x91CA;&#x8FC7;&#x4E86;&#x3002;
1&#x3001;&#x9762;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#x4E0D;&#x662F;&#x5F88;&#x6DF1;&#xFF0C;&#x8FD9;&#x4E2A;&#x601D;&#x60F3;&#x4E0D;&#x96BE;&#x7406;&#x89E3;&#xFF0C;&#x8BB2;&#x6570;&#x7EC4;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4F53;&#x4F1A;&#x5230;&#x8FD9;&#x4E2A;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x7684;&#x7528;&#x6CD5;&#x3002;
2&#x3001;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53BB;&#x4F7F;&#x7528;&#xFF0C;&#x4ED6;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x5408;&#x662F;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5176;&#x5B9E;&#x5728;&#x7F16;&#x7A0B;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x63A5;&#x89E6;&#x5230;&#x5F88;&#x591A;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;createElement&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x3002;
3&#x3001;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x662F;&#x6309;&#x9700;&#x6C42;&#x6765;&#x51B3;&#x5B9A;&#x3002;&#x4E0D;&#x5FC5;&#x751F;&#x642C;&#x786C;&#x5957;&#x7684;&#x53BB;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#xFF0C;&#x5E94;&#x8BE5;&#x81EA;&#x7136;&#x800C;&#x7136;&#x7684;&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x9AD8;&#x4F4E;&#x4F18;&#x52A3;&#x4E4B;&#x5206;&#x3002;&#x6BD4;&#x5982;&#x89C6;&#x9891;&#x4E2D;&#x8BF4;&#x7684;&#x5BCC;&#x58EB;&#x5EB7;&#x7684;&#x5DE5;&#x5382;&#xFF0C;&#x4ED6;&#x7684;&#x751F;&#x4EA7;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x4EE3;&#x5DE5;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x8BF4;&#x5B83;&#x7684;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x4F4E;&#x7EA7;&#xFF0C;&#x56E0;&#x4E3A;&#x5BCC;&#x58EB;&#x5EB7;&#x7684;&#x5B9A;&#x4F4D;&#x5C31;&#x662F;&#x4EE3;&#x5DE5;&#x751F;&#x4EA7;&#xFF0C;&#x751F;&#x4EA7;&#x7684;&#x6548;&#x7387;&#x4E5F;&#x5F88;&#x9AD8;&#x3002;&#x6A21;&#x5F0F;&#x7684;&#x4F7F;&#x7528;&#x5728;&#x4E8E;&#x7F16;&#x7A0B;&#x7684;&#x5FEB;&#x6377;&#x9700;&#x6C42;&#xFF0C;&#x9700;&#x6C42;&#x51B3;&#x5B9A;&#x6A21;&#x5F0F;&#x7684;&#x9009;&#x62E9;&#x3002;
4&#x3001;Js&#x4E0D;&#x9700;&#x8981;&#x5904;&#x7406;&#x5927;&#x6279;&#x91CF;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;js&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x662F;&#x7075;&#x6D3B;&#x9AD8;&#x6548;&#x7684;&#xFF0C;&#x76F8;&#x5BF9;&#x662F;&#x6BD4;&#x8F83;&#x7626;&#x5C0F;&#x7684;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;js&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x5927;&#x6570;&#x636E;&#x91CF;&#x7684;&#x7279;&#x70B9;&#xFF0C;js&#x5C31;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6267;&#x884C;&#xFF0C;&#x6807;&#x7B7E;&#x8F83;&#x5C11;&#xFF0C;&#x6570;&#x636E;&#x91CF;&#x8F83;&#x5C0F;&#x3002;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4E3A;&#x7075;&#x6D3B;&#x9AD8;&#x6548;&#x800C;&#x670D;&#x52A1;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x6253;&#x4E00;&#x4E2A;&#x868A;&#x5B50;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x98DE;&#x673A;&#x5927;&#x70AE;&#xFF0C;&#x4E00;&#x4E2A;&#x82CD;&#x8747;&#x62CD;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x9700;&#x6C42;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x7F16;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x6807;&#x7B7E;&#x591A;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x51E0;&#x5343;&#x4E2A;&#xFF0C;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x8FC7;&#x591A;&#x7684;&#x53BB;&#x5F3A;&#x8C03;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3002;</p>
</blockquote>
<h2 id="t113 &#x6570;&#x7EC4;&#x57FA;&#x7840;">3 &#x6570;&#x7EC4;&#x57FA;&#x7840; <a href="#t113 &#x6570;&#x7EC4;&#x57FA;&#x7840;"> # </a></h2>
<h3 id="t123.1 &#x6570;&#x7EC4;&#x5B9A;&#x4E49;">3.1 &#x6570;&#x7EC4;&#x5B9A;&#x4E49; <a href="#t123.1 &#x6570;&#x7EC4;&#x5B9A;&#x4E49;"> # </a></h3>
<p>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x6570;&#x7EC4;&#x76F4;&#x63A5;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<pre><code>var arr = [0,1,2,3,4,5,6,7,8];
console.log(arr1);    //5,6,7,8,9
</code></pre><p>&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#xFF1A;</p>
<pre><code>var arr=new Array(&#x5143;&#x7D20;1&#xFF0C;&#x5143;&#x7D20;2&#x2026;.&#x5143;&#x7D20;n)
</code></pre><h3 id="t133.2 &#x6570;&#x7EC4;&#x65B9;&#x6CD5;">3.2 &#x6570;&#x7EC4;&#x65B9;&#x6CD5; <a href="#t133.2 &#x6570;&#x7EC4;&#x65B9;&#x6CD5;"> # </a></h3>
<p>&#x6570;&#x7EC4;&#x6709;&#x5F88;&#x591A;&#x5185;&#x7F6E;&#x7684;&#x5F3A;&#x5927;&#x65B9;&#x6CD5;&#xFF0C;&#x7B80;&#x5355;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#xFF1A;</p>
<h4 id="t143.2.1 &#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x548C;&#x5220;&#x9664;">3.2.1 &#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x548C;&#x5220;&#x9664; <a href="#t143.2.1 &#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x548C;&#x5220;&#x9664;"> # </a></h4>
<p>a) push()
&#x8BE5;&#x65B9;&#x6CD5;&#x53EF;&#x5411;&#x6570;&#x7EC4;&#x7684;&#x672B;&#x5C3E;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6216;&#x662F;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x65B0;&#x7684;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x3002;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x6765;&#x7406;&#x89E3;&#xFF0C;push&#x662F;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x538B;&#x6808;&#x64CD;&#x4F5C;&#xFF0C;&#x6808;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x5F88;&#x6DF1;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E0D;&#x8981;&#x88AB;&#x5413;&#x5012;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x684C;&#x5B50;&#x4E0A;&#x5806;&#x4E86;&#x539A;&#x539A;&#x7684;&#x4E00;&#x645E;&#x4E66;&#xFF0C;&#x538B;&#x6808;&#x5C31;&#x662F;&#x628A;&#x4E66;&#x4E00;&#x672C;&#x672C;&#x7684;&#x5F80;&#x4E0A;&#x52A0;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#x3002;&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#xFF1A;arr.push(ele1&#xFF0C;ele2&#x2026;eleN)&#xFF1B;&#x5176;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x5FC5;&#x586B;&#x7684;&#xFF0C;&#x6307;&#x8981;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x53C2;&#x6570;&#x53EF;&#x9009;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x4E00;&#x822C;&#x53EA;&#x4F20;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x505A;&#x904D;&#x5386;&#x5373;&#x53EF;&#x3002;
b) unshift()
&#x8BE5;&#x65B9;&#x6CD5;&#x53EF;&#x5411;&#x6570;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x65B0;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x4E0D;&#x8981;&#x548C;push&#x65B9;&#x6CD5;&#x6DF7;&#x6DC6;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x8FDB;&#x884C;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x672B;&#x5C3E;&#x8FDB;&#x884C;&#x5143;&#x7D20;&#x7684;&#x6DFB;&#x52A0;&#x3002;&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#xFF1A;arr.unshift(ele1&#xFF0C;ele2&#x2026;eleN);
c) concat()
&#x8BE5;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x4E24;&#x4E2A;&#x6216;&#x662F;&#x591A;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x73B0;&#x6709;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x53EA;&#x662F;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x88AB;&#x8FDE;&#x63A5;&#x540E;&#x7684;&#x6570;&#x7EC4;&#x3002;&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#xFF1A;arr.concat(arr1&#xFF0C;arr2&#x2026;arrN);</p>
<pre><code>var arr = [0,1,2,3,4,5,6,7,8];
var arr2 = arr.concat([1,2,3], [22,33,44]);
console.log(arr2);    //0,1,2,3,4,5,6,7,8,1,2,3,22,33,44
</code></pre><p>d) pop()
&#x8BE5;&#x65B9;&#x6CD5;&#x548C;push&#x65B9;&#x6CD5;&#x5BF9;&#x5E94;&#xFF0C;&#x4F46;&#x529F;&#x80FD;&#x76F8;&#x53CD;&#xFF0C;&#x7528;&#x4E8E;&#x5220;&#x9664;&#x5E76;&#x8FD4;&#x56DE;&#x6570;&#x7EC4;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x4F1A;&#x88AB;&#x51CF;1&#x3002;&#x5982;&#x679C;&#x6570;&#x7EC4;&#x5DF2;&#x7ECF;&#x4E3A;&#x7A7A;&#xFF0C;&#x518D;&#x53BB;&#x6267;&#x884C;pop()&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x6B64;&#x65F6;&#x4F1A;&#x8FD4;&#x56DE;undefined&#x503C;&#x3002;&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#xFF1A;arr.pop()&#xFF0C;&#x6CE8;&#x610F;&#x62EC;&#x53F7;&#x5185;&#x4E0D;&#x53EF;&#x4F20;&#x53C2;&#x6570;&#x3002;
e) shift()
&#x8BE5;&#x65B9;&#x6CD5;&#x548C;unshift&#x65B9;&#x6CD5;&#x5BF9;&#x5E94;&#xFF0C;&#x4F46;&#x529F;&#x80FD;&#x76F8;&#x53CD;&#xFF0C;&#x7528;&#x4E8E;&#x5220;&#x9664;&#x5E76;&#x8FD4;&#x56DE;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#xFF1A;arr.shift();</p>
<h4 id="t153.2.2 slice&#x548C;splice&#x65B9;&#x6CD5;">3.2.2 slice&#x548C;splice&#x65B9;&#x6CD5; <a href="#t153.2.2 slice&#x548C;splice&#x65B9;&#x6CD5;"> # </a></h4>
<p>a) slice()
&#x8BE5;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4ECE;&#x5DF2;&#x6709;&#x7684;&#x6570;&#x7EC4;&#x4E2D;&#x8FD4;&#x56DE;&#x89C4;&#x5B9A;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x5305;&#x542B;start&#x5230;end&#xFF08;&#x6CE8;&#x610F;&#xFF0C;&#x4E0D;&#x5305;&#x542B;&#x8BE5;&#x5143;&#x7D20;&#xFF09;&#x7684;arrObj&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<pre><code>var arr = [0,1,2,3,4,5,6,7,8];
var arr1 = arr.slice(5, 1);
console.log(arr1);    //5,6,7,8,9
</code></pre><p>&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#xFF1A;arr.slice(start, end)&#xFF0C;&#x5176;&#x4E2D;&#x53C2;&#x6570;start&#x5FC5;&#x586B;&#xFF0C;&#x5B83;&#x89C4;&#x5B9A;&#x4E86;&#x5F00;&#x59CB;&#x9009;&#x53D6;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x662F;&#x8D1F;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x662F;&#x8868;&#x793A;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x5C3E;&#x90E8;&#x5F00;&#x59CB;&#x7B97;&#x8D77;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;-1&#x4E3A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;-2&#x4E3A;&#x5012;&#x6570;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x2026;&#xFF09;&#xFF1B;&#x53C2;&#x6570;end&#x662F;&#x9009;&#x7684;&#xFF0C;&#x5B83;&#x89C4;&#x5B9A;&#x4E86;&#x4ECE;&#x4F55;&#x5904;&#x7ED3;&#x675F;&#x9009;&#x53D6;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4F20;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x4ECE;&#x89C4;&#x5B9A;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x4E00;&#x76F4;&#x9009;&#x53D6;&#x5230;&#x7ED3;&#x675F;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x8D1F;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x5C3E;&#x90E8;&#x5F00;&#x59CB;&#x7B97;&#x8D77;&#x7684;&#x5143;&#x7D20;&#x3002;&#x5728;&#x7B2C;&#x56DB;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x63A2;&#x8BA8;slice&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x3002;
b) splice()
&#x8BE5;&#x65B9;&#x6CD5;&#x529F;&#x80FD;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5BF9;&#x6570;&#x7EC4;&#x6267;&#x884C;&#x6DFB;&#x52A0;&#x3001;&#x5220;&#x9664;&#x548C;&#x63D2;&#x5165;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x88AB;&#x5220;&#x9664;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x4F1A;&#x6539;&#x53D8;&#x539F;&#x59CB;&#x7684;&#x6570;&#x7EC4;&#x3002;
&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#xFF1A;arr.splice(index&#xFF0C;count&#xFF0C;item1&#xFF0C;item2&#x2026;itemN)&#xFF1B;
&#x53C2;&#x6570;&#x8BF4;&#x660E;&#xFF1A;index&#x662F;&#x5FC5;&#x586B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x4E14;&#x5FC5;&#x987B;&#x662F;&#x6574;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4E86;&#x6DFB;&#x52A0;&#x6216;&#x662F;&#x5220;&#x9664;&#x9879;&#x76EE;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x4E14;index&#x4E3A;&#x8D1F;&#x6570;&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x53EF;&#x4EE5;&#x4ECE;&#x6570;&#x7EC4;&#x7ED3;&#x5C3E;&#x5904;&#x89C4;&#x5B9A;&#x7684;&#x4F4D;&#x7F6E;&#x6267;&#x884C;&#x8BE5;&#x65B9;&#x6CD5;&#xFF1B;count&#x4E5F;&#x662F;&#x5FC5;&#x586B;&#x53C2;&#x6570;&#xFF0C;&#x6307;&#x5B9A;&#x8981;&#x5220;&#x9664;&#x7684;&#x9879;&#x76EE;&#x6570;&#x91CF;&#xFF0C;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;0&#xFF0C;&#x5219;&#x4E0D;&#x5220;&#x9664;&#x9879;&#x76EE;&#xFF0C;&#x540E;&#x9762;&#x6DFB;&#x52A0;&#x53C2;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x53EF;&#x5B9E;&#x73B0;&#x63D2;&#x5165;&#x7684;&#x529F;&#x80FD;&#x4E86;&#xFF1B;item&#x662F;&#x53EF;&#x9009;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4F20;&#xFF0C;&#x5219;&#x6307;&#x5411;&#x5220;&#x9664;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F20;&#x5165;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6DFB;&#x52A0;&#x548C;&#x63D2;&#x5165;&#x7684;&#x529F;&#x80FD;
&#x5177;&#x4F53;&#x8303;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;
1).    &#x63D2;&#x5165;&#x529F;&#x80FD;(&#x53EA;&#x63D2;&#x5165;)&#xFF1A;splice(start, 0, args);//&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x5904;&#x7406;&#x540E;&#x7684;&#x6570;&#x7EC4;
2).    &#x66FF;&#x6362;&#x529F;&#x80FD;&#xFF08;&#x5220;&#x9664;&#x548C;&#x63D2;&#x5165;&#xFF09;&#xFF1A;splice(start, delCount, args);//&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x5904;&#x7406;&#x540E;&#x7684;&#x6570;&#x7EC4;
3).    &#x5220;&#x9664;&#x529F;&#x80FD;&#xFF08;&#x53EA;&#x5220;&#x9664;&#xFF09;&#xFF1A;splice(start, delCount);//&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x88AB;&#x5220;&#x9664;&#x7684;&#x5143;&#x7D20;&#x6570;&#x7EC4;&#xFF0C;&#x82E5;&#x6CA1;&#x6709;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x7A7A;&#x6570;&#x7EC4;</p>
<p>&#x5728;&#x5F00;&#x59CB;&#x4E86;&#x89E3;&#x8FD9;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x666E;&#x53CA;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5373;&#x9690;&#x5F0F;&#x8C03;&#x7528;&#x548C;&#x663E;&#x5F0F;&#x8C03;&#x7528;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x6240;&#x8C13;&#x663E;&#x5F0F;&#x8C03;&#x7528;&#x5373;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x7F16;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E3B;&#x52A8;&#x7684;&#x53BB;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x9690;&#x5F0F;&#x8C03;&#x7528;&#x5219;&#x662F;js&#x5728;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#x5728;&#x8FDB;&#x884C;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x65F6;&#x81EA;&#x52A8;&#x9ED8;&#x8BA4;&#x7684;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x3002;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x8FD9;&#x91CC;&#x63D0;&#x53CA;&#x9690;&#x5F0F;&#x8C03;&#x7528;&#x5462;&#xFF0C;&#x7531;&#x4E8E;toString()&#x548C;valueOf()&#x7B49;&#x65B9;&#x6CD5;&#x5C5E;&#x4E8E;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x90FD;&#x5171;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90FD;&#x4F1A;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x9690;&#x5F0F;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x5B8C;&#x6210;&#x76F8;&#x5173;&#x7684;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x3002;</p>
<h4 id="t163.2.3 toString&#x65B9;&#x6CD5;">3.2.3 toString&#x65B9;&#x6CD5; <a href="#t163.2.3 toString&#x65B9;&#x6CD5;"> # </a></h4>
<p>&#xF0D8;    &#x8BE5;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5C06;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x503C;&#x8F6C;&#x6362;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code>var age = 123;
var str = age.toString();//str&#x7ED3;&#x679C;&#x4E3A;&#x201D;123&#x201D;
var b = false;
var bToString = b.toString();//bToString &#x7ED3;&#x679C;&#x4E3A;&#x201D;false&#x201D;
</code></pre><p>&#xF0D8;    &#x6570;&#x503C;&#x3001;&#x5E03;&#x5C14;&#x503C;&#x3001;&#x5BF9;&#x8C61;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x90FD;&#x6709;toString&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;null&#x548C;undefined&#x503C;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;
&#xF0D8;    toString&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x9700;&#x8981;&#x4F20;&#x9012;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x8BE5;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x4EE5;&#x5341;&#x8FDB;&#x5236;&#x7684;&#x683C;&#x5F0F;&#x8FD4;&#x56DE;&#x6570;&#x503C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5982;&#x679C;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x7ED9;toString()&#x7684;&#x8BDD;&#x5219;&#x53EF;&#x4EE5;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x3001;&#x516B;&#x8FDB;&#x5236;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x7684;&#x76F8;&#x5E94;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code>var num = 16;
console.log(num.toString(2));//10000 &#x4E8C;&#x8FDB;&#x5236;
console.log(num.toString(8));//20 &#x516B;&#x8FDB;&#x5236;
console.log(num.toString(16));//10 &#x5341;&#x516D;&#x8FDB;&#x5236;
console.log(num.toString(5));//31 &#x867D;&#x7136;&#x6CA1;&#x6709;&#x4E94;&#x8FDB;&#x5236;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x4F20;&#x53C2;&#x662F;&#x53EF;&#x4EE5;&#x88AB;toString()&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x7684;
</code></pre><p>&#xF0D8;    &#x6CA1;&#x6709;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;toString&#x65B9;&#x6CD5;&#xFF0C;&#x770B;&#x770B;&#x8C03;&#x7528;toString&#x65B9;&#x6CD5;&#x5C06;Object&#x7C7B;&#x578B;&#x8F6C;&#x5316;&#x6210;string&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code>var obj = {name:&quot;Tom&quot;, age:18};
console.log(obj.toString());//&quot;[object Object]&quot;
//&#x6B64;&#x65F6;&#x8C03;&#x7528;&#x7684;&#x662F;&#x4ECE;Object&#x7EE7;&#x627F;&#x6765;&#x7684;&#x539F;&#x59CB;&#x7684;toString()&#x65B9;&#x6CD5;
</code></pre><p>&#xF0D8;    toString&#x65B9;&#x6CD5;&#x7684;&#x5999;&#x7528;---&#x5224;&#x65AD;&#x6570;&#x636E;&#x7C7B;&#x578B;</p>
<pre><code>Object.prototype.toString.call(null);//&#x201D;[object Null]&#x201D;
Object.prototype.toString.call(undefined);//&#x201D;[object Undefined]&#x201D;
Object.prototype.toString.call(&#x201C;abc&#x201D;);//&#x201D;[object String]&#x201D;
Object.prototype.toString.call(123);//&#x201D;[object Number]&#x201D;
Object.prototype.toString.call(true);//&#x201D;[object Boolean]&#x201D;
</code></pre><pre><code>function fn(){console.log(&#x201C;test&#x201D;);}//&#x51FD;&#x6570;&#x7C7B;&#x578B;
Object.prototype.toString.call(fn);//&#x201D;[object Function]&#x201D;
var arr = [1,2,3];//&#x6570;&#x7EC4;&#x7C7B;&#x578B;
Object.prototype.toString.call(arr);//&#x201D;[object Array]&#x201D;
</code></pre><h4 id="t173.2.4 &#x6392;&#x5E8F;&#x65B9;&#x6CD5;">3.2.4 &#x6392;&#x5E8F;&#x65B9;&#x6CD5; <a href="#t173.2.4 &#x6392;&#x5E8F;&#x65B9;&#x6CD5;"> # </a></h4>
<p>a) reverse()
&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x7528;&#x4E8E;&#x98A0;&#x5012;&#x6570;&#x7EC4;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x76F4;&#x63A5;&#x5728;&#x539F;&#x6570;&#x7EC4;&#x4E0A;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4F1A;&#x6539;&#x53D8;&#x539F;&#x6570;&#x7EC4;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x5E76;&#x4E14;&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x4F20;&#x53C2;&#xFF0C;&#x5982;&#xFF1A;arr.reverse()&#x3002;
b) sort()
&#x8BE5;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5BF9;&#x6570;&#x7EC4;&#x7684;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x548C;reverse&#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x4E5F;&#x662F;&#x76F4;&#x63A5;&#x5728;&#x539F;&#x6570;&#x7EC4;&#x4E0A;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x4F1A;&#x6539;&#x53D8;&#x539F;&#x6570;&#x7EC4;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x8BE5;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x4F20;&#x53C2;&#x597D;&#x597D;&#x8BF4;&#x660E;&#xFF0C;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x4F46;&#x4E0D;&#x4F20;&#x53C2;&#x65F6;&#xFF0C;&#x5982;arr.sort()&#xFF0C;&#x6B64;&#x65F6;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x6309;ASCII&#x7801;&#x7684;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x8FD9;&#x662F;&#x5C01;&#x88C5;&#x65B9;&#x6CD5;&#x65F6;&#x8FD9;&#x6837;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#x5C24;&#x5176;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x3002;</p>
<pre><code>var arr = [2,3,4,6,d,e,t,6];
arr.sort();
console.log(arr);
</code></pre><p>&#x5982;&#x679C;&#x9700;&#x8981;&#x6309;&#x5176;&#x4ED6;&#x7684;&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x51FD;&#x6570;&#x76F4;&#x63A5;&#x91CF;&#x4F5C;&#x4E3A;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4F20;&#x53C2;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x6392;&#x5E8F;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5199;&#x6CD5;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5347;&#x5E8F;&#x6392;&#x5E8F;&#xFF08;&#x5BF9;DOM&#x5143;&#x7D20;&#x6392;&#x5E8F;&#xFF0C;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x6392;&#x5E8F;&#xFF0C;&#x7528;&#x7684;&#x6392;&#x5E8F;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x7684;&#x601D;&#xFF09;&#xFF1A;</p>
<pre><code>var aNum = [33,22,67,3,543];
aNum.sort(function(a, b){
    console.log(aNum);
    return a-b;
});
</code></pre><p>&#x5E26;&#x5355;&#x4F4D;&#x589E;&#x5E8F;&#x964D;&#x5E8F;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>var aNum = [&apos;33px&apos;,&apos;22px&apos;,&apos;67px&apos;,&apos;3px&apos;,&apos;543px&apos;];
aNum.sort(function(a, b){
    console.log(aNum);
    return parseInt(a) - parseInt(b);
});
</code></pre><h4 id="t183.2.5 &#x6570;&#x7EC4;&#x8F6C;&#x6362;">3.2.5 &#x6570;&#x7EC4;&#x8F6C;&#x6362; <a href="#t183.2.5 &#x6570;&#x7EC4;&#x8F6C;&#x6362;"> # </a></h4>
<p>a) toLocaleString()
toLocaleString()&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5C06;&#x6570;&#x7EC4;&#x8F6C;&#x6362;&#x4E3A;&#x672C;&#x5730;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4F5C;&#x7528;&#x548C;toString&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x6B64;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x5730;&#x533A;&#x7279;&#x5B9A;&#x7684;&#x5206;&#x9694;&#x7B26;&#x6765;&#x5C06;&#x751F;&#x6210;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;
b) valueOf()
&#x8BE5;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;Array&#x5BF9;&#x8C61;&#x7684;&#x539F;&#x6570;&#x503C;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x5728;&#x540E;&#x53F0;&#x9690;&#x5F0F;&#x7684;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x663E;&#x5F0F;&#x7684;&#x51FA;&#x73B0;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x3002;
c) join()
&#x8BE5;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x90FD;&#x6309;&#x6307;&#x5B9A;&#x7684;&#x5206;&#x9694;&#x7B26;&#x5206;&#x9694;&#xFF0C;&#x8F6C;&#x6362;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x3002;
d) split()
&#x8BE5;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x6309;&#x7247;&#x6BB5;&#x5206;&#x9694;&#x521B;&#x5EFA;&#x6570;&#x7EC4;&#xFF0C;&#x548C;join()&#x7684;&#x529F;&#x80FD;&#x6B63;&#x597D;&#x76F8;&#x53CD;&#x3002;</p>
<h4 id="t193.2.6 &#x4F4D;&#x7F6E;&#x65B9;&#x6CD5;&#xFF08;ECMA5&#x7684;&#x65B9;&#x6CD5;&#xFF09;">3.2.6 &#x4F4D;&#x7F6E;&#x65B9;&#x6CD5;&#xFF08;ECMA5&#x7684;&#x65B9;&#x6CD5;&#xFF09; <a href="#t193.2.6 &#x4F4D;&#x7F6E;&#x65B9;&#x6CD5;&#xFF08;ECMA5&#x7684;&#x65B9;&#x6CD5;&#xFF09;"> # </a></h4>
<p>&#x4F4D;&#x7F6E;&#x65B9;&#x6CD5;&#x5305;&#x62EC;indexOf()&#x548C;lastIndexOf()&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x641C;&#x7D22;&#x6574;&#x4E2A;&#x6570;&#x7EC4;&#x4E2D;&#x5177;&#x6709;&#x7ED9;&#x5B9A;&#x503C;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x4E14;&#x8FD4;&#x56DE;&#x627E;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x7D22;&#x5F15;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;-1&#x3002;&#x4E24;&#x8005;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;indexOf&#x65B9;&#x6CD5;&#x662F;&#x4ECE;&#x5934;&#x81F3;&#x5C3E;&#x7684;&#x641C;&#x7D22;&#xFF0C;&#x800C;lastIndexOf&#x662F;&#x4ECE;&#x5C3E;&#x5411;&#x524D;&#x7684;&#x641C;&#x7D22;&#x3002;
&#x53C2;&#x6570;&#x8BF4;&#x660E;&#xFF1A;indexOf()&#x548C;lastIndexOf()&#x65B9;&#x6CD5;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x4F20;&#x5165;&#x7684;&#x662F;&#x9700;&#x8981;&#x641C;&#x7D22;&#x7684;&#x76EE;&#x6807;&#x503C;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x5373;&#x6307;&#x5B9A;&#x5F00;&#x59CB;&#x641C;&#x7D22;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4F20;&#x7684;&#x8BDD;&#xFF0C;indexOf()&#x65B9;&#x6CD5;&#x9ED8;&#x8BA4;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x641C;&#x7D22;&#xFF0C;lastIndexOf&#x65B9;&#x6CD5;&#x9ED8;&#x8BA4;&#x4ECE;&#x5C3E;&#x5F00;&#x59CB;&#x641C;&#x7D22;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x8D1F;&#x503C;&#xFF0C;&#x8868;&#x793A;&#x76F8;&#x5BF9;&#x6570;&#x7EC4;&#x672B;&#x5C3E;&#x7684;&#x504F;&#x79FB;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x4F7F;&#x5F97;&#x4EE5;&#x4E0A;&#x4E24;&#x65B9;&#x6CD5;&#x7684;&#x4F7F;&#x7528;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x660E;&#x786E;&#x7684;&#x754C;&#x9650;&#x3002;</p>
<h4 id="t203.2.7 &#x8FED;&#x4EE3;&#x65B9;&#x6CD5;&#xFF08;ECMA5&#x7684;&#x65B9;&#x6CD5;&#xFF09;">3.2.7 &#x8FED;&#x4EE3;&#x65B9;&#x6CD5;&#xFF08;ECMA5&#x7684;&#x65B9;&#x6CD5;&#xFF09; <a href="#t203.2.7 &#x8FED;&#x4EE3;&#x65B9;&#x6CD5;&#xFF08;ECMA5&#x7684;&#x65B9;&#x6CD5;&#xFF09;"> # </a></h4>
<p>&#x5728;&#x5B66;&#x4E60;&#x7406;&#x89E3;&#x8FD9;&#x4E94;&#x4E2A;&#x8FED;&#x4EE3;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5148;&#x6A21;&#x62DF;&#x4E00;&#x4E0B;forEach()&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x4FBF;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x4F20;&#x53C2;&#xFF08;&#x8FD9;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5F62;&#x5F0F;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF09;&#xFF0C;&#x8FD9;&#x5BF9;&#x540E;&#x7EED;&#x5B66;&#x4E60;&#x5F88;&#x6709;&#x5E2E;&#x5FD9;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4ECE;&#x6839;&#x5904;&#x6A21;&#x62DF;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x662F;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x601D;&#x8DEF;&#x6765;&#x5C01;&#x88C5;&#x7684;&#xFF0C;&#x597D;&#x4E86;&#xFF0C;&#x8BF7;&#x770B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>Array.prototype.forEach=function(fun,context){
    // forEach&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;
    var len=this.length;
    var context=arguments[1];//&#x5373;&#x4F7F;&#x4E3A;undefined&#xFF0C;call&#x51FD;&#x6570;&#x4E5F;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;
    if(typeof fun !==&quot;function&quot;){
        throw &quot;&#x8F93;&#x5165;&#x6B63;&#x786E;&#x51FD;&#x6570;!&quot;;
    }
    for(var i=0;i&lt;len;i++){
        fun.call(context,this[i],i,this);
//&#x6CE8;&#x610F;&#x8FD9;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5F88;&#x5173;&#x952E;&#xFF0C;context&#x662F;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5373;&#x4F5C;&#x7528;&#x5BF9;&#x8C61;&#xFF0C;this[i]&#x662F;&#x5404;&#x9879;&#x5143;&#x7D20;&#x7684;&#x503C;&#xFF0C;i&#x4E3A;&#x5404;&#x9879;&#x7684;&#x7D22;&#x5F15;&#x503C;&#xFF0C;this&#x4E3A;&#x6267;&#x884C;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x4F53;
    }
};
arr.forEach(function(item,index,arr){
    console.log(item,index,arr);
    //item           arr&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x7684;&#x5185;&#x5BB9;
    //index     &#x5404;&#x9879;&#x7684;&#x7D22;&#x5F15;&#x503C;
    //arr         &#x5373;&#x662F;&#x8F93;&#x5165;&#x7684;&#x539F;&#x6570;&#x7EC4;&#x503C;
});
</code></pre><p>&#x4EE3;&#x7801;&#x89E3;&#x6790;&#xFF1A;&#x5BA1;&#x67E5;&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x662F;&#x7528;&#x539F;&#x578B;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6A21;&#x62DF;forEach&#x7684;&#x5B9E;&#x73B0;&#xFF0C;forEach()&#x65B9;&#x6CD5;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x4F20;&#x53C2;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;fun&#xFF08;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;context&#xFF08;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x6267;&#x884C;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#x3002;&#x4E00;&#x822C;&#x5728;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F20;&#x5165;fun&#x5373;&#x53EF;&#xFF0C;&#x5728;fun&#x4E2D;&#x81EA;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5728;fun&#x4E2D;&#x6709;&#x4E09;&#x4E2A;&#x4F20;&#x53C2;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5199;&#x7684;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x8BF7;&#x7406;&#x89E3;&#x4E4B;&#x3002;
a) every()
&#x8BE5;&#x65B9;&#x6CD5;&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x8FD0;&#x884C;&#x7ED9;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#x76F4;&#x63A5;&#x91CF;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x51FD;&#x6570;&#x5BF9;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x8FD4;&#x56DE;true&#xFF0C;&#x5219;&#x8BE5;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;true&#xFF0C;&#x6CE8;&#x610F;&#x662F;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x8BE5;&#x65B9;&#x6CD5;&#x624D;&#x4F1A;&#x8FD4;&#x56DE;true&#x3002;</p>
<pre><code>var arr=[1,2,3,4,5,6,7];
var result=arr.every(function (item, index, array){ return item&gt;5; });
alert(result);    //&#x6B64;&#x65F6;&#x4F1A;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x662F; false;
var arr1=[3,4,5];
var result1=arr1.every(function (item, index, array){ return item&gt;2; });
alert(result1);    //&#x6B64;&#x65F6;&#x4F1A;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x662F; true;
</code></pre><p>b) filter()
&#x8BE5;&#x65B9;&#x6CD5;&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x8FD0;&#x884C;&#x7ED9;&#x5B9A;&#x51FD;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x8BE5;&#x51FD;&#x6570;&#x8FD4;&#x56DE;true&#x7684;&#x9879;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x4ECE;&#x5355;&#x8BCD;&#x5B57;&#x9762;&#x610F;&#x601D;&#x7406;&#x89E3;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x8FD4;&#x56DE;&#xFF0C;&#x4E0D;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x4E22;&#x5F03;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#xFF0C;&#x7528;&#x4E2A;&#x4F8B;&#x5B50;&#x8BF4;&#x660E;&#xFF1A;</p>
<pre><code>var arr=[1,2,3,4,5,6,7];
var result=arr.filter(function (item, index, array){ return item&gt;5; });
alert(result);    //&#x6B64;&#x65F6;&#x4F1A;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x662F; [6,7];
</code></pre><p>c) forEach
&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x8FD0;&#x884C;&#x7ED9;&#x5B9A;&#x51FD;&#x6570;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x3002;&#x5728;&#x7F16;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x4FBF;&#x5229;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x65B9;&#x6CD5;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x904D;&#x5386;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x4E0D;&#x7528;&#x6BCF;&#x6B21;&#x7684;&#x5199;&#x4E00;&#x4E2A;for&#x5FAA;&#x73AF;&#x6765;&#x83B7;&#x53D6;&#x6570;&#x7EC4;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x4E86;&#x3002;
d) map()
&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x8FD0;&#x884C;&#x7ED9;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x7ED3;&#x679C;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x6CE8;&#x610F;&#x54E6;&#xFF0C;&#x8FD9;&#x91CC;&#x8FD4;&#x56DE;&#x7684;&#x53EF;&#x662F;&#x6570;&#x7EC4;&#xFF0C;&#x548C;some()&#x7B49;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x5E03;&#x5C14;&#x503C;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x533A;&#x522B;&#x3002;
e) some()
&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x8FD0;&#x884C;&#x7ED9;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x51FD;&#x6570;&#x5BF9;&#x4EFB;&#x4E00;&#x9879;&#x90FD;&#x8FD4;&#x56DE;true&#xFF0C;&#x5219;&#x8BE5;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;true&#xFF0C;&#x548C;every()&#x65B9;&#x6CD5;&#x6709;&#x70B9;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x533A;&#x522B;&#x554A;&#x4EB2;&#xFF0C;&#x7B80;&#x5355;&#x533A;&#x522B;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x4ECE;&#x5355;&#x8BCD;&#x4E0B;&#x624B;&#xFF0C;every()&#x662F;&#x4F20;&#x5165;&#x7684;&#x51FD;&#x6570;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x6B21;&#x554A;&#x4F1A;&#x8FD4;&#x56DE;true&#xFF1B;&#x800C;some()&#x65B9;&#x6CD5;&#x662F;&#x53EA;&#x8981;&#x4F20;&#x5165;&#x7684;&#x51FD;&#x6570;&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x9879;&#x8FD4;&#x56DE;true&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x5C31;&#x4F1A;&#x8FD4;&#x56DE;true&#x3002;</p>
<h4 id="t213.2.8 &#x7F29;&#x5C0F;&#x65B9;&#x6CD5;">3.2.8 &#x7F29;&#x5C0F;&#x65B9;&#x6CD5; <a href="#t213.2.8 &#x7F29;&#x5C0F;&#x65B9;&#x6CD5;"> # </a></h4>
<p>a) reduce()
&#x8BE5;&#x65B9;&#x6CD5;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x9879;&#x5F00;&#x59CB;&#x9010;&#x4E2A;&#x904D;&#x5386;&#x81F3;&#x5C3E;&#xFF0C;&#x4F7F;&#x7528;&#x6307;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#x6765;&#x5C06;&#x6570;&#x7EC4;&#x7684;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x6574;&#x5408;&#xFF0C;&#x53EA;&#x751F;&#x6210;&#x5355;&#x4E2A;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7F29;&#x5C0F;&#x65B9;&#x6CD5;&#xFF0C;&#x5F88;&#x597D;&#x7406;&#x89E3;&#x5427;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#xFF0C;reduce()&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x6267;&#x884C;&#x5316;&#x7B80;&#x64CD;&#x4F5C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x5FC5;&#x9700;&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x4F20;&#x9012;&#x7ED9;&#x51FD;&#x6570;&#x7684;&#x521D;&#x8BD5;&#x503C;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x7406;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;&#x6240;&#x8C13;&#x521D;&#x59CB;&#x503C;&#x5C31;&#x662F;&#x4F20;&#x7ED9;&#x7B2C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x5C31;&#x662F;&#x4E0A;&#x4E00;&#x6B21;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4E86;&#xFF0C;&#x800C;&#x5F53;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F20;&#x53C2;&#x4E0D;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5316;&#x7B80;&#x51FD;&#x6570;&#x5C31;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x4F5C;&#x4E3A;&#x5176;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x3002;&#x8BF7;&#x7ED3;&#x5408;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x7406;&#x89E3;&#xFF1A;</p>
<pre><code>var arr=[1,2,3,4,4,5,6,6];
var sum=arr.reduce(function (x, y){ return x+y; }, 0);    //&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x6C42;&#x548C;
var multi=arr.reduce(function (x, y){ return x*y}, 1);    //&#x6C42;&#x51FA;&#x6570;&#x7EC4;&#x4E2D;&#x5404;&#x5143;&#x7D20;&#x7684;&#x79EF;
var max=arr.reduce(function (x, y){ return (x&gt;y)?x:y});    //&#x6C42;&#x51FA;&#x6700;&#x5927;&#x503C;&#x4E3A;6
</code></pre><p>b) reduceRight()
&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4F7F;&#x7528;&#x548C;reduce()&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x8054;&#x60F3;&#x5230;indexOf()&#x65B9;&#x6CD5;&#x548C;lastIndexOf()&#x65B9;&#x6CD5;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5373;reduceRight()&#x65B9;&#x6CD5;&#x662F;&#x6309;&#x7167;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x4ECE;&#x9AD8;&#x5230;&#x4F4E;&#x7684;&#x5904;&#x7406;&#x6570;&#x7EC4;&#x3002;</p>
<h2 id="t224 &#x6570;&#x7EC4;&#x548C;&#x9762;&#x5411;&#x5BF9;&#x8C61;">4 &#x6570;&#x7EC4;&#x548C;&#x9762;&#x5411;&#x5BF9;&#x8C61; <a href="#t224 &#x6570;&#x7EC4;&#x548C;&#x9762;&#x5411;&#x5BF9;&#x8C61;"> # </a></h2>
<h3 id="t234.1&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5173;&#x7CFB;">4.1&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5173;&#x7CFB; <a href="#t234.1&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5173;&#x7CFB;"> # </a></h3>
<p>&#x6570;&#x7EC4;&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#xFF1A;&#x4F7F;&#x7528;typeof&#x5BF9;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x8FD0;&#x7B97;&#x540E;&#x4F1A;&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x201C;object&#x201D;&#xFF0C;&#x8FD9;&#x4FBF;&#x8DB3;&#x4EE5;&#x8BF4;&#x660E;&#x6570;&#x7EC4;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x6570;&#x7EC4;&#x662F;&#x6709;&#x5E8F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;&#xFF1A;&#x6570;&#x7EC4;&#x662F;&#x4E00;&#x6BB5;&#x7EBF;&#x6027;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6574;&#x6570;&#x53BB;&#x8BA1;&#x7B97;&#x504F;&#x79FB;&#x5E76;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x7531;&#x6B64;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6570;&#x7EC4;&#x662F;&#x6709;&#x5E8F;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x6570;&#x7EC4;&#x662F;&#x4E00;&#x79CD;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;&#x56E0;&#x4E3A;&#x6570;&#x7EC4;&#x7684;&#x5C5E;&#x6027;&#x90FD;&#x662F;&#x4EE5;&#x6570;&#x5B57;&#x5F62;&#x5F0F;&#x5B58;&#x653E;&#x5728;&#x6808;&#x4E2D;&#xFF0C;&#x4ECE;&#x6808;&#x4E2D;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x662F;&#x975E;&#x5E38;&#x5FEB;&#x6377;&#x7684;&#x3002;</p>
<p>&#x7C7B;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#xFF1A;&#x800C;&#x7531;&#x4E8E;JavaScript&#x4E2D;&#x6CA1;&#x6709;&#x6570;&#x7EC4;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4F46;&#x5374;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x62E5;&#x6709;&#x4E00;&#x4E9B;&#x7C7B;&#x6570;&#x7EC4;&#x7279;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x6570;&#x7EC4;&#x7684;&#x4E0B;&#x6807;&#x8F6C;&#x53D8;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x79CD;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x7C7B;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x3002;&#x867D;&#x7136;&#x7C7B;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x6BD4;&#x771F;&#x6B63;&#x7684;&#x6570;&#x7EC4;&#x6162;&#xFF0C;&#x4F46;&#x5B83;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x5374;&#x66F4;&#x52A0;&#x7684;&#x7075;&#x6D3B;&#x65B9;&#x4FBF;&#xFF0C;&#x4E14;&#x5176;&#x5C5E;&#x6027;&#x7684;&#x68C0;&#x7D22;&#x548C;&#x66F4;&#x65B0;&#x65B9;&#x5F0F;&#x548C;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<h3 id="t244.2&#x6570;&#x7EC4;&#x7684;&#x524D;&#x4E16;&#x4ECA;&#x751F;">4.2&#x6570;&#x7EC4;&#x7684;&#x524D;&#x4E16;&#x4ECA;&#x751F; <a href="#t244.2&#x6570;&#x7EC4;&#x7684;&#x524D;&#x4E16;&#x4ECA;&#x751F;"> # </a></h3>
<p>Js&#x4E2D;&#x7684;Object&#x662F;&#x539F;&#x59CB;&#x7684;&#x7C7B;&#xFF0C;&#x8D1F;&#x8D23;&#x6784;&#x9020;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>Var obj=  {name: &#x2018;&#x2019;,age:22, height:199 };
</code></pre><p>&#x4F46;&#x7531;&#x4E8E;&#x65B9;&#x6CD5;&#x4E0D;&#x8DB3;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5957;&#x5C01;&#x88C5;&#x6570;&#x636E;&#x7684;&#x57FA;&#x672C;&#x6A21;&#x578B;&#xFF0C;&#x7531;&#x4E8E;&#x529F;&#x80FD;&#x6709;&#x9650;&#x9700;&#x8981;&#x66F4;&#x6539;&#x548C;&#x6539;&#x8FDB;&#xFF0C;&#x6709;&#x4E86;&#x4EE5;&#x4E0B;&#x7684;&#x5173;&#x8054;&#x6570;&#x7EC4;&#xFF1A;</p>
<pre><code>Obj[&#x2018;name&#x2019;];    //php&#x4E2D;&#x53EB;&#x505A;&#x5173;&#x8054;&#x6570;&#x7EC4;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x4E3A;&#x7D22;&#x5F15;&#xFF0C;&#x4F5C;&#x4E3A;&#x67E5;&#x627E;&#x503C;&#x7684;&#x4F9D;&#x636E;
Obj[&#x2018;age&#x2019;];
</code></pre><p>Js&#x662F;&#x5F88;&#x5C0F;&#x5DE7;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x3002;&#x628A;&#x5BF9;&#x8C61;&#x91CC;&#x9762;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x505A;&#x4E86;&#x6539;&#x8FDB;&#xFF0C;&#x628A;&#x6570;&#x5B57;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5C5E;&#x6027;&#xFF0C;&#x7D22;&#x5F15;&#xFF0C;&#x8FD9;&#x6837;&#x6539;&#x8FDB;&#x7684;&#x597D;&#x5904;&#xFF1A;&#x6570;&#x5B57;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6D3E;&#x751F;&#x51FA;&#x4E86;&#x6570;&#x7EC4;&#x7C7B;----Array&#x7C7B;&#x3002;
&#x6570;&#x7EC4;&#x53EA;&#x80FD;&#x4EE5;&#x6570;&#x5B57;&#x4E3A;&#x7D22;&#x5F15;&#x5C5E;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x5B83;&#x7684;&#x539F;&#x578B;&#x4E0A;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>var a = [&#x2018;1&#x2019;, &#x2018;2&#x2019;, &#x2018;3&#x2019;];
length&#x5C5E;&#x6027;&#xFF1B;//Array.prototype.length
splice&#x65B9;&#x6CD5;&#xFF1B;
sort&#x65B9;&#x6CD5;&#x7B49;,&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x51FA;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;
</code></pre><p>&#x628A;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x5728;&#x539F;&#x578B;&#x4E0A;&#xFF0C;&#x628A;0,1,2&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x81EA;&#x5B9A;&#x4E49;&#x5728;&#x7C7B;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x7528;&#x5199;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5199;&#x503C;&#x4E86;&#x3002;&#x5BF9;&#x8C61;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x4FBF;&#x82D7;&#x6761;&#x7684;&#x63CF;&#x8FF0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x6570;&#x7EC4;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x6F14;&#x53D8;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x7840;&#x4E86;&#x52A0;&#x4E86;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x800C;&#x4EA7;&#x751F;&#x7684;&#xFF0C;Array&#x7EE7;&#x627F;&#x53C8;&#x4E30;&#x5BCC;&#x4E86;Object&#x7C7B;&#x3002;</p>
<h3 id="t254.3 &#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#x7684;&#x540C;&#x6E90;&#x6027;">4.3 &#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#x7684;&#x540C;&#x6E90;&#x6027; <a href="#t254.3 &#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#x7684;&#x540C;&#x6E90;&#x6027;"> # </a></h3>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x5BF9;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#x5305;&#x56F4;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x503C;&#x6765;&#x65B9;&#x4FBF;&#x7684;&#x521B;&#x5EFA;&#x65B0;&#x6570;&#x7EC4;</p>
<pre><code>var empty=[];
var num=[0,  1,  21.2, true, false, &#x2018;string&#x2019;, null, undefined, [&#x2018;another&#x2019;, &#x2018;array&#x2019;], {object: true}, NaN, Infinity ];
empty.length == 0;//true,&#x6570;&#x7EC4;empty&#x7684;&#x957F;&#x5EA6;&#x4E3A;0;
num.length == 12; //true,&#x6570;&#x7EC4;num&#x7684;&#x957F;&#x5EA6;&#x4E3A;12&#xFF0C;&#x4E14;&#x6570;&#x7EC4;&#x4E2D;&#x5141;&#x8BB8;&#x5305;&#x597D;&#x4EFB;&#x610F;&#x6DF7;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;
</code></pre><p>&#x5728;&#x6570;&#x7EC4;num&#x4E2D;&#xFF0C;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#x5C06;&#x81EA;&#x52A8;&#x83B7;&#x5F97;&#x5C5E;&#x6027;&#x540D;&#x2018;0&#x2019;&#xFF0C; &#x7B2C;&#x4E8C;&#x4E2A;&#x503C;&#x5C06;&#x83B7;&#x5F97;&#x5C5E;&#x6027;&#x540D;&#x2018;1&#x2019;&#xFF0C;&#x4F9D;&#x6B21;&#x7C7B;&#x63A8;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x76F4;&#x89C2;&#x7684;&#x770B;&#x5230;&#x6570;&#x7EC4;&#x6709;&#x5E8F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x7279;&#x6027;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x91CF;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x4E00;&#x6837;&#x6570;&#x636E;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code>var num_obj={
    &#x2018;0&#x2019;:0,
    &#x2018;1&#x2019;:1,
    &#x2018;2&#x2019;:21.2,
    &#x2018;3&#x2019;:true,
    &#x2018;4&#x2019;:false,
    &#x2018;5&#x2019;:&#x2019;string&#x2019;,
    &#x2018;6&#x2019;:null,
    &#x2018;7&#x2019;:undefined,
    &#x2018;8&#x2019;:[&#x2018;another&#x2019;, &#x2018;array&#x2019;],
    &#x2018;9&#x2019;:{object:true},
    &#x2018;10&#x2019;:NaN,
    &#x2018;11&#x2019;:Infinity
};
</code></pre><p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x7528;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x4FDD;&#x5B58;&#x4E86;&#x548C;&#x6570;&#x7EC4;num&#x4E00;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x6BCF;&#x4E00;&#x9879;&#x6570;&#x636E;&#x7684;&#x76F8;&#x5E94;&#x5C5E;&#x6027;&#x540D;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x76EE;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;num&#x7EE7;&#x627F;&#x81EA;Array.prototype&#xFF0C;&#x800C;num_obj&#x7EE7;&#x627F;&#x81EA;Object.prototype&#xFF0C;&#x6240;&#x4EE5;num&#x53EF;&#x4EE5;&#x6709;&#x5E8F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x800C;&#x4E14;&#x8FD8;&#x5177;&#x6709;length&#xFF08;&#x5F53;&#x7136;&#x540E;&#x9762;&#x4F1A;&#x63A5;&#x89E6;&#x5230;function&#x4E5F;&#x6709;length&#x5C5E;&#x6027;&#xFF0C;&#x800C;function&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x8BF4;&#x53EA;&#x6709;&#x6570;&#x7EC4;&#x6709;length&#x800C;&#x5BF9;&#x8C61;&#x5C31;&#x6CA1;&#x6709;length&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#xFF09;&#x3002;</p>
<h3 id="t264.4&#x68C0;&#x6D4B;&#x6570;&#x7EC4;&#x7C7B;&#x578B;">4.4&#x68C0;&#x6D4B;&#x6570;&#x7EC4;&#x7C7B;&#x578B; <a href="#t264.4&#x68C0;&#x6D4B;&#x6570;&#x7EC4;&#x7C7B;&#x578B;"> # </a></h3>
<p>&#x7531;&#x4E8E;&#x4EE5;&#x4E0A;&#x6240;&#x8BB2;&#x8FF0;&#x5230;&#x7684;&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x540C;&#x6E90;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x5728;JavaScript&#x4E2D;&#x5BF9;&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#x7684;&#x533A;&#x522B;&#x7ECF;&#x5E38;&#x662F;&#x6DF7;&#x4E71;&#x7684;&#xFF0C;&#x5728;&#x5BF9;&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;&#x4E0A;&#x4E5F;&#x7ECF;&#x5E38;&#x4E0D;&#x660E;&#x786E;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x5FC5;&#x8981;&#x660E;&#x786E;&#x4E24;&#x4E2A;&#x8BEF;&#x533A;&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x8981;&#x5728;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x65F6;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x65F6;&#x4F7F;&#x7528;&#x4E86;&#x6570;&#x7EC4;
&#x9009;&#x7528;&#x6570;&#x7EC4;&#x6216;&#x5BF9;&#x8C61;&#x7684;&#x89C4;&#x5219;&#xFF1A;&#x5F53;&#x5C5E;&#x6027;&#x540D;&#x662F;&#x5C0F;&#x800C;&#x8FDE;&#x7EED;&#x7684;&#x6574;&#x6570;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#xFF0C;&#x6216;&#x662F;&#x5F53;&#x5BF9;&#x5C5E;&#x6027;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x6392;&#x5217;&#x987A;&#x5E8F;&#x6709;&#x7279;&#x6B8A;&#x8981;&#x6C42;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x6B63;&#x786E;&#x533A;&#x5206;&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;
&#x4E0D;&#x80FD;&#x5355;&#x7EAF;&#x7684;&#x8FD0;&#x7528;typeof&#x6765;&#x68C0;&#x6D4B;&#x6570;&#x7EC4;&#xFF0C;&#x8FD9;&#x4F1A;&#x51FA;&#x73B0;&#x2018;object&#x2019;&#xFF0C;&#x901A;&#x8FC7;&#x6570;&#x7EC4;&#x53BB;&#x91CD;&#x6765;&#x6B63;&#x786E;&#x7406;&#x89E3;&#xFF1A;<pre><code>//&#x6570;&#x7EC4;&#x5185;&#x5355;&#x4E00;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x53BB;&#x91CD;&#x590D;
var a=[88,88,44,33,27,44,88,20,27,67,22,27,27];
//var a=[2,2,2,2,2,2,2,2,2,2,2,2,2]
Array.prototype.distinct=function (){//&#x5728;Array&#x539F;&#x578B;&#x4E0A;&#x62D3;&#x5C55;&#x53BB;&#x91CD;&#x65B9;&#x6CD5;
  var a=this;
  for(var j=0;j&lt;a.length-1;j++){//&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x53CC;&#x5FAA;&#x73AF;&#x9010;&#x4E2A;&#x6BD4;&#x8F83;
      var item=a[j];//&#x5C06;&#x5F85;&#x6BD4;&#x8F83;&#x7684;&#x6570;&#x63D0;&#x51FA;&#x6765;
      for(var i=j+1;i&lt;a.length;){
          if(item===a[i]){//&#x5F85;&#x6BD4;&#x8F83;&#x6570;&#x4E0E;&#x6570;&#x7EC4;&#x4E2D;&#x5176;&#x4ED6;&#x6570;&#x505A;&#x6BD4;&#x8F83;
              a.splice(i,1);    //&#x4E24;&#x6570;&#x76F8;&#x7B49;&#xFF0C;&#x5219;&#x5220;&#x9664;&#x76F8;&#x5E94;&#x9879;        
          }else{
              i++;
          }
      }
  }
}
alert(a.distinct());
alert(a);
</code></pre>&#x8FD9;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6570;&#x7EC4;&#x53BB;&#x91CD;&#x590D;&#xFF0C;&#x6570;&#x7EC4;&#x4E2D;&#x6CA1;&#x6709;&#x5305;&#x62EC;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x6570;&#xFF0C;&#x90FD;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6570;&#x503C;&#x53BB;&#x91CD;&#xFF0C;&#x5728;if&#x903B;&#x8F91;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F1A;&#x9690;&#x5F0F;&#x7684;&#x8C03;&#x7528;typeof&#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x5224;&#x65AD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x4F46;&#x662F;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x5305;&#x542B;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x65F6;&#xFF0C;&#x6B64;&#x65F6;&#x53BB;&#x91CD;&#x4FBF;&#x4E0D;&#x80FD;&#x5B9E;&#x73B0;&#x3002;<pre><code>var a=[88,88,{},{},{},33,27,44,88,20,27,67,22,27,27];
Array.prototype.distinct=function (){
  var a=this;
  var obj={};//&#x628A;&#x6570;&#x7EC4;&#x91CC;&#x7684;&#x6BCF;&#x4E2A;&#x503C;&#xFF0C;&#x8F6C;&#x53D8;&#x4E3A;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x548C;&#x503C;&#x3002;&#x5982;&#x679C;&#x5F53;&#x524D;&#x7684;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x91CD;&#x590D;
  for(var i=0;i&lt;a.length;){
      if(obj[a[i]]!=a[i]){
          //&#x7B2C;&#x4E00;&#x6B21;&#x662F;obj[88] !=88 obj[88]&#x662F;undefined
          //&#x5982;&#x679C;&#x4E0D;&#x7B49;&#x5219;&#x662F;true&#xFF0C;&#x5219;&#x7ED9;obj&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x548C;&#x503C;&#x76F8;&#x540C;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x8BF4;&#x660E;&#x5B83;&#x539F;&#x6765;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x8FC7;&#xFF0C;&#x73B0;&#x5728;&#x51FA;&#x73B0;&#x4E86;&#x5219;&#x5C06;&#x5176;&#x8F6C;&#x5316;&#x4E3A;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;
          //&#x7B2C;&#x4E8C; obj[88]&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;
          obj[a[i]]=a[i];//&#x8BF4;&#x660E;&#x6CA1;&#x6709;&#x91CD;&#x590D;&#x9879;
          i++;
      }else{
          a.splice(i,1);
      }
  }
}
alert(a.distinct());
alert(a);
</code></pre>&#x60F3;&#x77E5;&#x9053;&#x53BB;&#x91CD;&#x540E;alert(a)&#x7684;&#x7ED3;&#x679C;&#x5417;&#xFF1F;</li>
</ul>
<blockquote>
<p>&#x5C0F;&#x7ED3;&#xFF1A;&#x539F;&#x6765;&#x4F7F;&#x7528;&#x7684;typeof&#x8FD0;&#x7B97;&#x7B26;&#x5BF9;&#x6570;&#x7EC4;&#x7684;&#x68C0;&#x6D4B;&#x662F;&#x4E0D;&#x4E25;&#x8C28;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x542B;&#x6709;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x503C;&#x65F6;&#x8FDB;&#x884C;&#x53BB;&#x91CD;&#x4E0D;&#x80FD;&#x5B9E;&#x73B0;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x6570;&#x7EC4;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5224;&#x65AD;&#x3002;&#x65E2;&#x7136;&#x524D;&#x9762;&#x54B1;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x539F;&#x578B;&#x7B49;&#x77E5;&#x8BC6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x6D4B;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x4E86;&#x3002;</p>
<pre><code>var is_Array=function(value){
    return Object.prototype.toString.apply(value) === &apos;[object Array]&apos;;
}
</code></pre><p>&#x8865;&#x5145;&#xFF1A;call&#x548C;apply&#x7684;&#x5E94;&#x7528;&#x548C;&#x533A;&#x522B;
A) call &#x548C;apply&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x6539;&#x53D8;&#x88AB;&#x6267;&#x884C;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x6307;&#x5411;&#x4F20;&#x53C2;&#x6307;&#x5B9A;&#x7684;&#x65B0;&#x5BF9;&#x8C61;&#xFF0C;&#x5373;&#x66F4;&#x6539;&#x88AB;&#x6267;&#x884C;&#x51FD;&#x6570;&#x7684;&#x5185;&#x90E8;&#x6307;&#x9488;this&#x7684;&#x6307;&#x5411;&#x3002;&#x8FD9;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;js&#x7F16;&#x7A0B;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x65F6;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<pre><code>function fn(){
alert(this.x + this.y);
}
var obj = {x: 2, y: 1};
fn.call(obj);    //&#x5F39;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x4E3A;3
</code></pre><p>B) &#x4E24;&#x8005;&#x7684;&#x533A;&#x522B;&#xFF1A;</p>
<pre><code>Fn.call(context, arg1, arg2, arg3.....);//call&#x65B9;&#x6CD5;&#x4E2D;&#x7B2C;&#x4E8C;&#x4E2A;&#x4EE5;&#x540E;&#x7684;&#x4F20;&#x53C2;&#x4E0D;&#x9650;&#x4E2A;&#x6570;
Fn.apply(context, arg[i]);        //apply&#x65B9;&#x6CD5;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x5FC5;&#x987B;&#x4E3A;&#x6570;&#x7EC4;&#xFF0C;&#x6570;&#x7EC4;&#x4E2D;&#x4E3A;&#x9700;&#x8981;&#x4F20;&#x9012;&#x7684;&#x53C2;&#x6570;
</code></pre><h3 id="t274.3&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x6A21;&#x62DF;&#x4E0E;&#x6269;&#x5C55;(&#x6DF1;&#x5165;&#x7406;&#x89E3;prototype)">4.3&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x6A21;&#x62DF;&#x4E0E;&#x6269;&#x5C55;(&#x6DF1;&#x5165;&#x7406;&#x89E3;prototype) <a href="#t274.3&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#x6A21;&#x62DF;&#x4E0E;&#x6269;&#x5C55;(&#x6DF1;&#x5165;&#x7406;&#x89E3;prototype)"> # </a></h3>
</blockquote>
<p>&#x6B64;&#x8BB2;&#x4E3B;&#x8981;&#x662F;&#x8BB2;&#x6570;&#x7EC4;&#x7684;&#x539F;&#x7406;&#x6027;&#x7684;&#x4E1C;&#x897F;
&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5C01;&#x88C5;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x6570;&#x7EC4;&#x7C7B;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x3002;&#x4E00;&#x4E2A;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x5F52;&#x7EB3;&#x5206;&#x7C7B;&#xFF1B;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x7684;&#x5206;&#x7C7B;&#xFF0C;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x65B9;&#x6CD5;&#x3002;&#x4EE5;&#x4E0B;&#x5206;&#x89E3;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x63A2;&#x7A76;Array&#x4E0A;&#x65B9;&#x6CD5;&#x7684;&#x7531;&#x6765;&#xFF1A;</p>
<pre><code>//&#x590D;&#x5236;&#x6570;&#x7EC4;&#x91CC;&#x7684;&#x7B2C;s&#x5230;&#x7B2C;e&#x9879;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x539F;&#x6765;&#x7684;&#x5B9E;&#x4F8B;
Array.prototype.slice = function(s, e){
    var arr = [];
    e = (typeof e == &apos;number&apos;)?e:this.length;
    for(var i=s;i&lt;e;i++){
        arr.push(this[i]);
    }
    return arr;
};
var arr = [0,1,2,3,4,5,6,7,8];
arr.slice();
</code></pre><h4 id="t284.3.1 &#x6570;&#x7EC4;&#x53BB;&#x91CD;&#x590D;&#x7684;&#x5B9E;&#x73B0;">4.3.1 &#x6570;&#x7EC4;&#x53BB;&#x91CD;&#x590D;&#x7684;&#x5B9E;&#x73B0; <a href="#t284.3.1 &#x6570;&#x7EC4;&#x53BB;&#x91CD;&#x590D;&#x7684;&#x5B9E;&#x73B0;"> # </a></h4>
<pre><code class="lang-Javasript">/*------------------------
 *&#x51FD;&#x6570;&#x540D;&#x79F0;&#xFF1A;Array.prototype.distinct
 *&#x529F;&#x80FD;&#x63CF;&#x8FF0;&#xFF1A;&#x727A;&#x7272;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#xFF0C;&#x5229;&#x7528;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x91CD;
 *&#x601D;    &#x8DEF;&#xFF1A;
 *-----------------------*/
Array.prototype.distinct=function (){
    var obj={};//&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x6570;&#x7EC4;&#x4E2D;&#x4E0D;&#x91CD;&#x590D;&#x7684;&#x5143;&#x7D20;
    for(var i=0;i</code></pre>
<h4 id="t294.3.2 &#x6570;&#x7EC4;&#x514B;&#x9686;&#x7684;&#x5B9E;&#x73B0;">4.3.2 &#x6570;&#x7EC4;&#x514B;&#x9686;&#x7684;&#x5B9E;&#x73B0; <a href="#t294.3.2 &#x6570;&#x7EC4;&#x514B;&#x9686;&#x7684;&#x5B9E;&#x73B0;"> # </a></h4>
<pre><code class="lang-Javasript">  Array.prototype.clone = function(){
      return this.slice(0);    //&#x5229;&#x7528;js&#x5185;&#x7F6E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6267;&#x884C;&#x6548;&#x7387;&#x7279;&#x522B;&#x9AD8;
  };
  Array.prototype.clone = function(){
      var a = [];
      for(var i=0;i</code></pre>

        <div class="copyright">Powered by <a href="https://github.com/jaywcjlove/idoc" target="_blank">idoc</a>. Dependence <a href="https://nodejs.org">Node.js</a> run.</div>
    </div>

</div>


</body>
</html>
