<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>MyTechBook</title>
    <link rel="stylesheet" type="text/css" href="../../static/css/main.css">
</head>
<body>
<div class="navbar navbar-line">
    <div class="container">
        <div class="logo">
            
                MyTechBook
            
        </div>
        <ul><li><a href="../../index.html">首页</a></li><li><a href="#"><span></span>前端工程化</a><ul><li><a href="../../html/前端工程化/前端模板.html">前端模板</a></li><li class="active"><a href="../../html/前端工程化/前端集成解决方案.html">前端集成解决方案</a></li><li><a href="../../html/前端工程化/项目技术栈规划.html">项目技术栈规划</a></li></ul></li><li><a href="#"><span></span>性能优化</a><ul><li><a href="../../html/性能优化/jshint代码质量检测.html">jshint代码质量检测</a></li><li><a href="../../html/性能优化/性能优化待办事项.html">性能优化待办事项</a></li><li><a href="../../html/性能优化/性能优化点总结.html">性能优化点总结</a></li><li><a href="../../html/性能优化/NC性能优化.html">NC性能优化</a></li><li><a href="../../html/性能优化/jshint配置说明.html">jshint配置说明</a></li></ul></li><li><a href="#"><span></span>技术分享</a><ul><li><a href="../../html/技术分享/React技术分享.html">React技术分享</a></li><li><a href="../../html/技术分享/学习Git.html">学习Git</a></li><li><a href="../../html/技术分享/面向对象.html">面向对象</a></li></ul></li><li><a href="../../html/关于我.html">关于我</a></li></ul>
        
        
        <div class="forkgithub"><a target="_blank" href="https://github.com/GuoYongfeng">fork on github</a></div>
        
    </div>
    
</div>




<div class="container">

    <div class="page-toc">
        <ul><li><a href="#t0对前端集成解决方案的思考">对前端集成解决方案的思考</a><ul><li><a href="#t1吐槽">吐槽</a></li><li><a href="#t2前端需要解决什么问题">前端需要解决什么问题</a><ul><li><a href="#t3第一阶段：规范与设计">第一阶段：规范与设计</a></li><li><a href="#t4第二阶段：技术选型">第二阶段：技术选型</a></li><li><a href="#t5第三阶段：自动化与拆分">第三阶段：自动化与拆分</a></li><li><a href="#t6第四阶段：性能优化">第四阶段：性能优化</a></li></ul></li><li><a href="#t7对方案的细化">对方案的细化</a><ul><li><a href="#t8开发规范">开发规范</a></li><li><a href="#t9模块化开发">模块化开发</a></li><li><a href="#t10组件化开发">组件化开发</a></li><li><a href="#t11组件仓库">组件仓库</a></li><li><a href="#t12性能优化">性能优化</a></li><li><a href="#t13项目部署">项目部署</a></li><li><a href="#t14开发流程">开发流程</a></li><li><a href="#t15开发工具">开发工具</a></li></ul></li><li><a href="#t16方案应该以什么样的方式提供">方案应该以什么样的方式提供</a><ul><li><a href="#t17图形化">图形化</a></li><li><a href="#t18命令行">命令行</a></li></ul></li><li><a href="#t19我们何去何从">我们何去何从</a><ul><li><a href="#t20其一">其一</a></li><li><a href="#t21其二">其二</a></li></ul></li></ul></li></ul>
    </div>
    
    <div class="content markdown-body">
        <h1 id="t0&#x5BF9;&#x524D;&#x7AEF;&#x96C6;&#x6210;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x601D;&#x8003;">&#x5BF9;&#x524D;&#x7AEF;&#x96C6;&#x6210;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x601D;&#x8003; <a href="#t0&#x5BF9;&#x524D;&#x7AEF;&#x96C6;&#x6210;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x601D;&#x8003;"> # </a></h1>
<h2 id="t1&#x5410;&#x69FD;">&#x5410;&#x69FD; <a href="#t1&#x5410;&#x69FD;"> # </a></h2>
<blockquote>
<p>&#x4ECA;&#x5929;BOSS&#x5410;&#x69FD;&#x4E86;&#x4E00;&#x987F;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x987A;&#x5E26;&#x7763;&#x4FC3;&#x524D;&#x7AEF;&#x6027;&#x80FD;&#x7684;&#x4F18;&#x5316;&#x5DE5;&#x4F5C;&#x63A8;&#x8FDB;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5728;&#x8003;&#x8651;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x4EA7;&#x54C1;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x8C8C;&#x4F3C;&#x4E5F;&#x662F;&#x9886;&#x5BFC;&#x6BD4;&#x8F83;&#x5728;&#x610F;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD9;&#x5DF2;&#x7ECF;&#x662F;&#x4E2A;&#x4EBA;&#x4EBA;&#x90FD;&#x5728;&#x558A;&#x4E92;&#x8054;&#x7F51;+&#x7684;&#x65F6;&#x4EE3;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x770B;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#x5728;&#x505A;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5FD9;&#x5FD9;&#x788C;&#x788C;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EA7;&#x51FA;&#x4E86;&#x4E0D;&#x5C11;&#x6210;&#x679C;&#xFF0C;&#x5149;&#x770B;&#x4EE3;&#x7801;&#x91CF;&#x90FD;&#x77E5;&#x9053;&#x8FD9;&#x7FA4;&#x7801;&#x519C;&#x662F;&#x6709;&#x591A;&#x8F9B;&#x82E6;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x4E0D;&#x62AC;&#x5934;&#x770B;&#x8DEF;&#xFF0C;&#x6C38;&#x8FD0;&#x53EA;&#x80FD;&#x50CF;&#x6C34;&#x725B;&#x4E00;&#x6837;&#xFF0C;&#x7F13;&#x6162;&#x7684;&#x5E72;&#x7740;&#x4F53;&#x529B;&#x6D3B;&#xFF0C;&#x786E;&#x4ECD;&#x65E7;&#x4E1D;&#x6BEB;&#x4E0D;&#x6562;&#x61C8;&#x6020;&#x7684;&#x5F80;&#x524D;&#x8D70;&#xFF0C;&#x751F;&#x6015;&#x4E3B;&#x4EBA;&#x5728;&#x540E;&#x9762;&#x62FF;&#x7740;&#x76AE;&#x97AD;&#x5F80;&#x8EAB;&#x4E0A;&#x62BD;&#x3002;</p>
</blockquote>
<p>&#x6536;&#xFF0C;&#x4E0B;&#x9762;&#x5207;&#x5165;&#x6B63;&#x9898;&#x5427;&#x3002;</p>
<h2 id="t2&#x524D;&#x7AEF;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;">&#x524D;&#x7AEF;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898; <a href="#t2&#x524D;&#x7AEF;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;"> # </a></h2>
<blockquote>
<p>&#x8C08;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x7EDD;&#x5BF9;&#x662F;&#x9700;&#x8981;&#x7AD9;&#x5728;&#x4E00;&#x4E2A;&#x5F88;&#x9AD8;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#x9762;&#x6765;&#x601D;&#x8003;&#x3002;&#x524D;&#x7AEF;&#x53D1;&#x5C55;&#x8FD9;&#x4E48;&#x4E9B;&#x5E74;&#xFF0C;&#x96F6;&#x96F6;&#x6563;&#x6563;&#x7684;&#x6280;&#x672F;&#x5F88;&#x591A;&#xFF0C;&#x9996;&#x5148;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x524D;&#x7AEF;&#x56E2;&#x961F;&#x8981;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x65F6;&#x6240;&#x9700;&#x8981;&#x7ECF;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p>
</blockquote>
<p><strong>&#x5907;&#x6CE8;&#xFF1A;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x6574;&#x7406;&#x81EA;@fouber</strong></p>
<h3 id="t3&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#xFF1A;&#x89C4;&#x8303;&#x4E0E;&#x8BBE;&#x8BA1;">&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#xFF1A;&#x89C4;&#x8303;&#x4E0E;&#x8BBE;&#x8BA1; <a href="#t3&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#xFF1A;&#x89C4;&#x8303;&#x4E0E;&#x8BBE;&#x8BA1;"> # </a></h3>
<ul>
<li>&#x5B9A;&#x5236;&#x5FC5;&#x8981;&#x7684;&#x5F00;&#x53D1;&#x89C4;&#x8303;</li>
<li>&#x5B9A;&#x5236;&#x9879;&#x76EE;&#x7684;&#x7EC4;&#x4EF6;&#x5316;&#x62C6;&#x5206;&#x65B9;&#x6848;</li>
</ul>
<h3 id="t4&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF1A;&#x6280;&#x672F;&#x9009;&#x578B;">&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF1A;&#x6280;&#x672F;&#x9009;&#x578B; <a href="#t4&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF1A;&#x6280;&#x672F;&#x9009;&#x578B;"> # </a></h3>
<ul>
<li>&#x9009;&#x62E9;&#x6A21;&#x5757;&#x5316;&#x89C4;&#x8303;</li>
<li>&#x9009;&#x62E9;&#x524D;&#x7AEF;&#x7EC4;&#x4EF6;&#x5316;&#x6846;&#x67B6;</li>
<li>&#x9009;&#x62E9;&#x524D;&#x7AEF;&#x57FA;&#x7840;&#x5E93;</li>
<li>&#x9009;&#x62E9;&#x6A21;&#x677F;&#x8BED;&#x8A00;</li>
<li>&#x9009;&#x62E9;&#x6A21;&#x677F;&#x5F15;&#x64CE;</li>
</ul>
<h3 id="t5&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#xFF1A;&#x81EA;&#x52A8;&#x5316;&#x4E0E;&#x62C6;&#x5206;">&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#xFF1A;&#x81EA;&#x52A8;&#x5316;&#x4E0E;&#x62C6;&#x5206; <a href="#t5&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#xFF1A;&#x81EA;&#x52A8;&#x5316;&#x4E0E;&#x62C6;&#x5206;"> # </a></h3>
<ul>
<li>&#x9009;&#x62E9;&#x6216;&#x5F00;&#x53D1;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#xFF08;&#x6253;&#x5305;&#xFF0C;&#x538B;&#x7F29;&#xFF0C;&#x6821;&#x9A8C;&#x7B49;&#xFF09;</li>
<li>&#x5C06;&#x7CFB;&#x7EDF;&#x62C6;&#x5206;&#x4E3A;&#x51E0;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x4FBF;&#x5927;&#x56E2;&#x961F;&#x5E76;&#x884C;&#x5F00;&#x53D1;</li>
<li>&#x9002;&#x5F53;&#x8C03;&#x6574;&#x6846;&#x67B6;&#x4EE5;&#x9002;&#x5E94;&#x5DE5;&#x5177;&#x4EA7;&#x51FA;</li>
</ul>
<h3 id="t6&#x7B2C;&#x56DB;&#x9636;&#x6BB5;&#xFF1A;&#x6027;&#x80FD;&#x4F18;&#x5316;">&#x7B2C;&#x56DB;&#x9636;&#x6BB5;&#xFF1A;&#x6027;&#x80FD;&#x4F18;&#x5316; <a href="#t6&#x7B2C;&#x56DB;&#x9636;&#x6BB5;&#xFF1A;&#x6027;&#x80FD;&#x4F18;&#x5316;"> # </a></h3>
<ul>
<li>&#x524D;&#x7AEF;&#x8D44;&#x6E90;&#x7684;&#x7075;&#x6D3B;&#x7EF4;&#x62A4;&#x6027;</li>
<li>&#x4F18;&#x5316;http&#x8BF7;&#x6C42;</li>
<li>&#x9002;&#x5F53;&#x8C03;&#x6574;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x4EE5;&#x9002;&#x5E94;&#x6027;&#x80FD;&#x4F18;&#x5316;</li>
<li>&#x4F7F;&#x7528;&#x67B6;&#x6784;&#x7EA7;&#x4F18;&#x5316;&#x65B9;&#x6848;</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x662F;&#x603B;&#x7ED3;&#x7684;&#x524D;&#x7AEF;&#x56E2;&#x961F;&#x7684;&#x4E00;&#x4E2A;&#x53D1;&#x5C55;&#x8FC7;&#x7A0B;&#x4F1A;&#x9762;&#x5BF9;&#x5230;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x518D;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x57FA;&#x4E8E;&#x53D1;&#x5C55;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x7528;&#x603B;&#x7ED3;&#x51FA;&#x4E00;&#x5957;&#x5B8C;&#x6574;&#x7684;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6240;&#x5305;&#x542B;&#x7684;&#x6280;&#x672F;&#x57FA;&#x7840;&#x3002;</p>
<ul>
<li><strong>&#x524D;&#x7AEF;&#x6846;&#x67B6;</strong>&#xFF1A;&#x63D0;&#x4F9B;&#x7EC4;&#x4EF6;&#x52A0;&#x8F7D;&#x53CA;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#x652F;&#x6301;&#xFF0C;&#x63D0;&#x4F9B;&#x524D;&#x7AEF;&#x57FA;&#x7840;&#x5E93;&#x53CA;&#x7EC4;&#x4EF6;&#x5E93;&#x3002;</li>
<li><strong>&#x6A21;&#x677F;&#x6846;&#x67B6;</strong>&#xFF1A;&#x63D0;&#x4F9B;&#x7EC4;&#x4EF6;&#x5316;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x652F;&#x6301;&#xFF1B;&#x914D;&#x5408;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#x6536;&#x96C6;&#x9875;&#x9762;&#x6240;&#x9700;&#x8981;&#x7684;&#x6700;&#x5C0F;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x9700;&#x6C42;&#xFF1B;&#x7559;&#x6709;&#x5145;&#x5206;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7A7A;&#x95F4;&#xFF0C;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x5BF9;&#x5DE5;&#x7A0B;&#x5E08;&#x900F;&#x660E;&#x3002;</li>
<li><strong>&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;</strong>&#xFF1A;&#x63D0;&#x4F9B;&#x57FA;&#x672C;&#x4F18;&#x5316;&#x80FD;&#x529B;&#xFF1B;&#x4E3A;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#x3001;&#x6A21;&#x677F;&#x6846;&#x67B6;&#x63D0;&#x4F9B;&#x8F85;&#x52A9;&#x652F;&#x6301;&#x3002;</li>
<li><strong>&#x8F85;&#x52A9;&#x5F00;&#x53D1;&#x5DE5;&#x5177;</strong>&#xFF1A;&#x63D0;&#x5347;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5F00;&#x53D1;&#x4F53;&#x9A8C;&#xFF0C;&#x964D;&#x4F4E;&#x8C03;&#x8BD5;&#x3001;&#x90E8;&#x7F72;&#x6210;&#x672C;&#x3002;</li>
</ul>
<h2 id="t7&#x5BF9;&#x65B9;&#x6848;&#x7684;&#x7EC6;&#x5316;">&#x5BF9;&#x65B9;&#x6848;&#x7684;&#x7EC6;&#x5316; <a href="#t7&#x5BF9;&#x65B9;&#x6848;&#x7684;&#x7EC6;&#x5316;"> # </a></h2>
<h3 id="t8&#x5F00;&#x53D1;&#x89C4;&#x8303;">&#x5F00;&#x53D1;&#x89C4;&#x8303; <a href="#t8&#x5F00;&#x53D1;&#x89C4;&#x8303;"> # </a></h3>
<p>&#x5305;&#x62EC;&#x5F00;&#x53D1;&#x3001;&#x90E8;&#x7F72;&#x7684;&#x76EE;&#x5F55;&#x89C4;&#x8303;&#xFF0C;&#x7F16;&#x7801;&#x89C4;&#x8303;&#x7B49;&#x3002;&#x4E0D;&#x8981;&#x5C0F;&#x77A7;&#x89C4;&#x8303;&#x7684;&#x5A01;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x7684;&#x63D0;&#x5347;&#x5F00;&#x53D1;&#x6548;&#x7387;&#xFF0C;&#x771F;&#x6B63;&#x4F18;&#x79C0;&#x7684;&#x89C4;&#x8303;&#x4E0D;&#x4F1A;&#x8BA9;&#x4F7F;&#x7528;&#x8005;&#x611F;&#x5230;&#x7EA6;&#x675F;&#xFF0C;&#x800C;&#x662F;&#x80FD;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x5347;&#x6548;&#x7387;&#x3002;</p>
<h3 id="t9&#x6A21;&#x5757;&#x5316;&#x5F00;&#x53D1;">&#x6A21;&#x5757;&#x5316;&#x5F00;&#x53D1; <a href="#t9&#x6A21;&#x5757;&#x5316;&#x5F00;&#x53D1;"> # </a></h3>
<p>&#x9488;&#x5BF9;js&#x3001;css&#xFF0C;&#x4EE5;&#x529F;&#x80FD;&#x6216;&#x4E1A;&#x52A1;&#x4E3A;&#x5355;&#x5143;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#x3002;js&#x65B9;&#x9762;&#x89E3;&#x51B3;&#x72EC;&#x7ACB;&#x4F5C;&#x7528;&#x57DF;&#x3001;&#x4F9D;&#x8D56;&#x7BA1;&#x7406;&#x3001;api&#x66B4;&#x9732;&#x3001;&#x6309;&#x9700;&#x52A0;&#x8F7D;&#x4E0E;&#x6267;&#x884C;&#x3001;&#x5B89;&#x5168;&#x5408;&#x5E76;&#x7B49;&#x95EE;&#x9898;&#xFF0C;css&#x65B9;&#x9762;&#x89E3;&#x51B3;&#x4F9D;&#x8D56;&#x7BA1;&#x7406;&#x3001;&#x7EC4;&#x4EF6;&#x5185;&#x90E8;&#x6837;&#x5F0F;&#x7BA1;&#x7406;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x662F;&#x63D0;&#x5347;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x7684;&#x91CD;&#x8981;&#x57FA;&#x7840;&#x3002;&#x73B0;&#x5728;&#x6D41;&#x884C;&#x7684;&#x6A21;&#x5757;&#x5316;&#x6846;&#x67B6;&#x6709;requirejs&#x3001;seajs&#x7B49;&#x3002;</p>
<h3 id="t10&#x7EC4;&#x4EF6;&#x5316;&#x5F00;&#x53D1;">&#x7EC4;&#x4EF6;&#x5316;&#x5F00;&#x53D1; <a href="#t10&#x7EC4;&#x4EF6;&#x5316;&#x5F00;&#x53D1;"> # </a></h3>
<p>&#x5728;&#x6A21;&#x5757;&#x5316;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x4EE5;&#x9875;&#x9762;&#x5C0F;&#x90E8;&#x4EF6;(component)&#x4E3A;&#x5355;&#x4F4D;&#x5C06;&#x9875;&#x9762;&#x5C0F;&#x90E8;&#x4EF6;&#x7684;js&#x3001;css&#x3001;html&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x3001;&#x7EF4;&#x62A4;&#xFF0C;&#x7EC4;&#x4EF6;&#x5355;&#x5143;&#x662F;&#x8D44;&#x6E90;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x7EC4;&#x4EF6;&#x5728;&#x7CFB;&#x7EDF;&#x5185;&#x53EF;&#x590D;&#x7528;&#x3002;&#x6BD4;&#x5982;&#x5934;&#x90E8;(header)&#x3001;&#x5C3E;&#x90E8;(footer)&#x3001;&#x641C;&#x7D22;&#x6846;(searchbar)&#x3001;&#x5BFC;&#x822A;(menu)&#x3001;&#x5BF9;&#x8BDD;&#x6846;(dialog)&#x7B49;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x7EC4;&#x4EF6;&#x6BD4;&#x5982;&#x7F16;&#x8F91;&#x5668;(editor)&#x7B49;&#x3002;&#x901A;&#x5E38;&#x4E1A;&#x52A1;&#x4F1A;&#x9488;&#x5BF9;&#x7EC4;&#x4EF6;&#x5316;&#x7684;js&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x7EC4;&#x4EF6;&#x6E32;&#x67D3;&#x3001;&#x4EA4;&#x4E92;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="t11&#x7EC4;&#x4EF6;&#x4ED3;&#x5E93;">&#x7EC4;&#x4EF6;&#x4ED3;&#x5E93; <a href="#t11&#x7EC4;&#x4EF6;&#x4ED3;&#x5E93;"> # </a></h3>
<p>&#x6709;&#x4E86;&#x7EC4;&#x4EF6;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5C06;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x901A;&#x7528;&#x7684;&#x7EC4;&#x4EF6;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x7684;&#x5730;&#x65B9;&#x4F9B;&#x56E2;&#x961F;&#x5171;&#x4EAB;&#xFF0C;&#x65B9;&#x4FBF;&#x65B0;&#x9879;&#x76EE;&#x590D;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x4ED3;&#x5E93;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x73B0;&#x5728;&#x6D41;&#x884C;&#x7684;&#x7EC4;&#x4EF6;&#x5E93;&#x6709;bower&#x3001;component&#x7B49;&#x3002;&#x56E2;&#x961F;&#x53D1;&#x5C55;&#x5230;&#x4E00;&#x5B9A;&#x89C4;&#x6A21;&#x540E;&#xFF0C;&#x7EC4;&#x4EF6;&#x5E93;&#x7684;&#x9700;&#x6C42;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5F3A;&#x70C8;&#x3002;</p>
<h3 id="t12&#x6027;&#x80FD;&#x4F18;&#x5316;">&#x6027;&#x80FD;&#x4F18;&#x5316; <a href="#t12&#x6027;&#x80FD;&#x4F18;&#x5316;"> # </a></h3>
<p>&#x8FD9;&#x91CC;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x662F;&#x6307;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x5DE5;&#x7A0B;&#x624B;&#x6BB5;&#x4FDD;&#x8BC1;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x70B9;&#x3002;&#x7531;&#x4E8E;&#x5176;&#x5185;&#x5BB9;&#x6BD4;&#x8F83;&#x4E30;&#x5BCC;&#xFF0C;&#x5C31;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x5C55;&#x5F00;&#x4E86;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#x6211;&#x7684;&#x8FD9;&#x4E24;&#x7BC7;&#x6587;&#x7AE0; [1] [2]&#x3002;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x662F;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x53D1;&#x5C55;&#x5230;&#x4E00;&#x5B9A;&#x9636;&#x6BB5;&#x5FC5;&#x987B;&#x7ECF;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x6211;&#x60F3;&#x5F3A;&#x8C03;&#x7684;&#x4E00;&#x70B9;&#x662F; &#x6027;&#x80FD;&#x4F18;&#x5316;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x95EE;&#x9898;&#x548C;&#x7EDF;&#x8BA1;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x80FD;&#x7528;&#x5DE5;&#x7A0B;&#x624B;&#x6BB5;&#x4FDD;&#x8BC1;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x662F;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#xFF0C;&#x4F18;&#x5316;&#x65F6;&#x53EA;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x9996;&#x6B21;&#x52A0;&#x8F7D;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x5168;&#x5C40;&#x5728;&#x5B8F;&#x89C2;&#x7EDF;&#x8BA1;&#x4E0A;&#x7684;&#x4F18;&#x5316;&#x63D0;&#x5347;&#x4E5F;&#x662F;&#x7247;&#x9762;&#x7684;&#x3002;</p>
<h3 id="t13&#x9879;&#x76EE;&#x90E8;&#x7F72;">&#x9879;&#x76EE;&#x90E8;&#x7F72; <a href="#t13&#x9879;&#x76EE;&#x90E8;&#x7F72;"> # </a></h3>
<p>&#x90E8;&#x7F72;&#x6309;&#x7167;&#x73B0;&#x884C;&#x4E1A;&#x754C;&#x7684;&#x5206;&#x5DE5;&#x6807;&#x51C6;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;&#x8303;&#x7574;&#xFF0C;&#x4F46;&#x5B83;&#x5BF9;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5305;&#x62EC;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x7F13;&#x5B58;&#x3001;cdn&#x3001;&#x975E;&#x8986;&#x76D6;&#x5F0F;&#x53D1;&#x5E03;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x5408;&#x7406;&#x7684;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x8D44;&#x6E90;&#x90E8;&#x7F72;&#x53EF;&#x4EE5;&#x4E3A;&#x524D;&#x7AEF;&#x6027;&#x80FD;&#x5E26;&#x6765;&#x8F83;&#x5927;&#x7684;&#x4F18;&#x5316;&#x7A7A;&#x95F4;&#x3002;</p>
<h3 id="t14&#x5F00;&#x53D1;&#x6D41;&#x7A0B;">&#x5F00;&#x53D1;&#x6D41;&#x7A0B; <a href="#t14&#x5F00;&#x53D1;&#x6D41;&#x7A0B;"> # </a></h3>
<p>&#x5B8C;&#x6574;&#x7684;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#x5305;&#x62EC;&#x672C;&#x5730;&#x5F00;&#x53D1;&#x8C03;&#x8BD5;&#x3001;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x8D70;&#x67E5;&#x786E;&#x8BA4;&#x3001;&#x524D;&#x540E;&#x7AEF;&#x8054;&#x8C03;&#x3001;&#x63D0;&#x6D4B;&#x3001;&#x4E0A;&#x7EBF;&#x7B49;&#x73AF;&#x8282;&#x3002;&#x5BF9;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#x7684;&#x6539;&#x5584;&#x53EF;&#x4EE5;&#x5927;&#x5E45;&#x964D;&#x4F4E;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x95F4;&#x6210;&#x672C;&#xFF0C;&#x5DE5;&#x4F5C;&#x8FD9;&#x4E9B;&#x5E74;&#x89C1;&#x8FC7;&#x5F88;&#x591A;&#x72EC;&#x7ACB;&#x7684;&#x7CFB;&#x7EDF;&#xFF08;CMS&#x7CFB;&#x7EDF;&#x3001;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x63A8;&#x9001;&#x7CFB;&#x7EDF;&#xFF09;&#x5C06;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#x5272;&#x88C2;&#x5F00;&#xFF0C;&#x5BF9;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x6548;&#x7387;&#x6709;&#x4E25;&#x91CD;&#x7684;&#x963B;&#x788D;&#x3002;</p>
<h3 id="t15&#x5F00;&#x53D1;&#x5DE5;&#x5177;">&#x5F00;&#x53D1;&#x5DE5;&#x5177; <a href="#t15&#x5F00;&#x53D1;&#x5DE5;&#x5177;"> # </a></h3>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x5DE5;&#x5177;&#x4E0D;&#x662F;&#x6307;IDE&#xFF0C;&#x800C;&#x662F;&#x5DE5;&#x7A0B;&#x5DE5;&#x5177;&#xFF0C;&#x5305;&#x62EC;&#x6784;&#x5EFA;&#x4E0E;&#x4F18;&#x5316;&#x5DE5;&#x5177;&#x3001;&#x5F00;&#x53D1;-&#x8C03;&#x8BD5;-&#x90E8;&#x7F72;&#x7B49;&#x6D41;&#x7A0B;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x53CA;&#x7EC4;&#x4EF6;&#x5E93;&#x83B7;&#x53D6;&#x3001;&#x63D0;&#x4EA4;&#x7B49;&#x76F8;&#x5173;&#x5DE5;&#x5177;&#xFF0C;&#x751A;&#x81F3;&#x8FD0;&#x8425;&#x3001;&#x6587;&#x6863;&#x3001;&#x914D;&#x7F6E;&#x53D1;&#x5E03;&#x7B49;&#x5E73;&#x53F0;&#x5DE5;&#x5177;&#x3002;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x9700;&#x8981;&#x5DE5;&#x5177;&#x652F;&#x6301;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#x6765;&#x81EA;&#x524D;&#x7AEF;&#x9886;&#x57DF;&#x8BED;&#x8A00;&#x7279;&#x6027;&#xFF08;&#x672A;&#x6765;&#x6211;&#x4F1A;&#x5355;&#x72EC;&#x5199;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4ECB;&#x7ECD;&#x524D;&#x7AEF;&#x9886;&#x57DF;&#x8BED;&#x8A00;&#x7F3A;&#x9677;&#x95EE;&#x9898;&#xFF09;&#x3002;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#xFF08;js&#x3001;css&#x3001;html&#xFF09;&#x4EE5;&#x53CA;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x8D44;&#x6E90;&#x7684;&#x52A0;&#x8F7D;&#x4E0E;&#x5B9A;&#x4F4D;&#x7B56;&#x7565;&#x51B3;&#x5B9A;&#x4E86;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5FC5;&#x987B;&#x8981;&#x5DE5;&#x5177;&#x652F;&#x6301;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8981;&#x60F3;&#x628A;&#x5B83;&#x4EEC;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x624D;&#x6709;&#x4E86;yeoman&#x8FD9;&#x6837;&#x7684;&#x5C01;&#x88C5;&#x3002;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;7&#x9879;&#x6280;&#x672F;&#x5143;&#x7D20;&#x90FD;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x7684;&#x5BF9;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x8BBE;&#x8BA1;&#x4EA7;&#x751F;&#x4E00;&#x5B9A;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x6B64;&#x80FD;&#x5426;&#x4E32;&#x8054;&#x5176;&#x4ED6;&#x6280;&#x672F;&#x8981;&#x7D20;&#xFF0C;&#x4F7F;&#x5F97;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x8FDE;&#x8D2F;&#x53EF;&#x6301;&#x7EED;&#x4F18;&#x5316;&#x7684;&#x5F00;&#x53D1;&#x4F53;&#x7CFB;&#xFF0C;&#x5DE5;&#x5177;&#x7684;&#x8BBE;&#x8BA1;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<h2 id="t16&#x65B9;&#x6848;&#x5E94;&#x8BE5;&#x4EE5;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;">&#x65B9;&#x6848;&#x5E94;&#x8BE5;&#x4EE5;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B; <a href="#t16&#x65B9;&#x6848;&#x5E94;&#x8BE5;&#x4EE5;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;"> # </a></h2>
<blockquote>
<p>&#x6682;&#x4E14;&#x5148;&#x628A;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x518D;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4E3B;&#x8981;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x52A0;&#x5165;&#x51C6;&#x5907;&#x51FA;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6848;&#x6765;&#x5E2E;&#x52A9;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x89E3;&#x51B3;&#x8FD9;&#x4E48;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x4F1A;&#x89C9;&#x5F97;&#x7528;&#x56FE;&#x5F62;&#x5316;&#x7684;IDE&#x6765;&#x64CD;&#x4F5C;&#x5408;&#x9002;&#xFF0C;&#x8FD8;&#x662F;&#x57FA;&#x4E8E;node&#x5C01;&#x88C5;&#x4E00;&#x4E2A;&#x5305;&#x63D0;&#x4F9B;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;</p>
</blockquote>
<h3 id="t17&#x56FE;&#x5F62;&#x5316;">&#x56FE;&#x5F62;&#x5316; <a href="#t17&#x56FE;&#x5F62;&#x5316;"> # </a></h3>
<p>&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;ide&#x6216;&#x662F;&#x5DE5;&#x5177;&#xFF0C;&#x70B9;&#x51FB;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x70B9;&#x51FB;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x4EE3;&#x7801;&#xFF0C;&#x70B9;&#x51FB;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x6027;&#x80FD;&#xFF0C;&#x70B9;&#x51FB;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x7BA1;&#x7406;&#x7248;&#x672C;&#xFF0C;&#x4F60;&#x4F1A;&#x4E0D;&#x4F1A;&#x5FC3;&#x52A8;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x96C6;&#x6210;&#x5728;&#x67D0;&#x4E2A;&#x4F60;&#x559C;&#x6B22;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x6216;&#x662F;IDE&#x4E0A;&#xFF0C;&#x4F60;&#x4F1A;&#x4E0D;&#x4F1A;&#x5FC3;&#x52A8;&#x3002;&#x4ED6;&#x4EEC;&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#xFF1A;</p>
<ul>
<li>Hbuilder</li>
<li>Eclipse</li>
<li>Webstorm</li>
<li>Intellig</li>
<li>...</li>
</ul>
<h3 id="t18&#x547D;&#x4EE4;&#x884C;">&#x547D;&#x4EE4;&#x884C; <a href="#t18&#x547D;&#x4EE4;&#x884C;"> # </a></h3>
<p>Node&#x5DF2;&#x7ECF;&#x706B;&#x904D;&#x5168;&#x7403;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x5728;&#x5439;&#x725B;&#xFF0C;&#x4F60;&#x53BB;npm&#x4E0A;&#x770B;&#x770B;&#x5168;&#x7403;&#x6BCF;&#x5929;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x4E0B;&#x8F7D;nodejs&#x4F60;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x770B;&#x770B;npm&#x4E0A;&#x6709;&#x591A;&#x5C11;&#x5F00;&#x53D1;&#x8005;&#x8D21;&#x732E;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x5305;&#x4F60;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x5C01;&#x88C5;&#x6210;&#x4E00;&#x4E2A;node&#x5305;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x8F7D;&#x540E;&#x4F60;&#x4FBF;&#x53EF;&#x4EE5;&#x5728;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x5730;&#x65B9;&#x4E00;&#x884C;&#x547D;&#x4EE4;&#x5904;&#x7406;&#x6240;&#x6709;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x5728;&#x8FD9;&#x6837;&#x5E72;&#xFF1A;</p>
<ul>
<li>FIS&#xFF08;&#x767E;&#x5EA6;&#xFF09;</li>
<li>JDF&#xFF08;&#x4EAC;&#x4E1C;&#xFF09;</li>
<li>Gulp</li>
<li>Grunt</li>
<li>Turbo&#xFF08;&#x7F8E;&#x56E2;&#xFF09;</li>
<li>fekit&#xFF08;&#x53BB;&#x54EA;&#x513F;&#xFF09;</li>
<li>coolie</li>
<li>webpack</li>
<li>...</li>
</ul>
<blockquote>
<p>&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;&#xFF1A;&#x56FE;&#x5F62;&#x5316;&#x6765;&#x641E;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#xFF0C;&#x8C8C;&#x4F3C;&#x4E0D;&#x592A;&#x53D7;&#x6B22;&#x8FCE;&#x3002;FIS&#x5728;2013&#x5E74;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x6B3E;&#x201C;FIS&#x53EF;&#x89C6;&#x5316;&#x64CD;&#x4F5C;&#x5DE5;&#x5177;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;git&#x4ED3;&#x5E93;&#x7684;&#x4EE3;&#x7801;&#x4E24;&#x5E74;&#x524D;&#x5C31;&#x6CA1;&#x6709;&#x4EBA;&#x7EF4;&#x62A4;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x6709;4&#x4E2A;commits&#x3002;&#x8FD9;&#x8BF4;&#x660E;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x662F;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x547D;&#x4EE4;&#x884C;&#x6765;&#x5F97;&#x7075;&#x6D3B;&#x5B9E;&#x5728;&#x3002;&#x8BDA;&#x7136;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7EDD;&#x5BF9;&#x7684;&#x8BBA;&#x70B9;&#x3002;</p>
</blockquote>
<h2 id="t19&#x6211;&#x4EEC;&#x4F55;&#x53BB;&#x4F55;&#x4ECE;">&#x6211;&#x4EEC;&#x4F55;&#x53BB;&#x4F55;&#x4ECE; <a href="#t19&#x6211;&#x4EEC;&#x4F55;&#x53BB;&#x4F55;&#x4ECE;"> # </a></h2>
<h3 id="t20&#x5176;&#x4E00;">&#x5176;&#x4E00; <a href="#t20&#x5176;&#x4E00;"> # </a></h3>
<ul>
<li>&#x5C01;&#x88C5;&#x57FA;&#x4E8E;nodejs&#x7684;&#x5DE5;&#x5177;&#x5305;&#xFF0C;&#x6765;&#x81EA;&#x52A8;&#x5316;&#x5904;&#x7406;&#x524D;&#x7AEF;&#x4E8B;&#x52A1;</li>
</ul>
<h3 id="t21&#x5176;&#x4E8C;">&#x5176;&#x4E8C; <a href="#t21&#x5176;&#x4E8C;"> # </a></h3>
<ul>
<li>&#x5BF9;&#x6A21;&#x677F;&#x8BED;&#x8A00;&#x505A;&#x4E00;&#x5B9A;&#x6269;&#x5C55;&#xFF0C;&#x5177;&#x5907;&#x52A0;&#x8F7D;widget&#x53CA;layout&#x9875;&#x9762;&#x7684;&#x80FD;&#x529B;</li>
</ul>

        <div class="copyright">Powered by <a href="https://github.com/jaywcjlove/idoc" target="_blank">idoc</a>. Dependence <a href="https://nodejs.org">Node.js</a> run.</div>
    </div>

</div>


</body>
</html>
